Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/simulation.po
Languages: fr

source: Use Niryo robot through simulation
fr: Utiliser les robots Niryo via la simulation

source: The simulation allows to control a virtual Ned directly from your computer.
fr: La simulation permet de contrôler virtuellement Ned depuis votre ordinateur.

source: Ned in Gazebo Simulation
fr: Ned dans la simulation de Gazebo

source: In this tutorial, you will learn how to setup a robot simulation on a computer.
fr: Avec ce tutoriel, apprenez à configurer une simulation sur un ordinateur.

source: You can use :niryo_studio_simulation:`Niryo Studio with the simulation<>`. To do so, you just have to connect Niryo Studio to "Localhost".
fr: Il est possible d'utiliser :niryo_studio_simulation:`Niryo Studio avec la simulation<>`. Pour cela il vous suffit de connecter Niryo Studio en "Localhost".

source: Simulation environment installation
fr: Installation de l'environnement de simulation

source: The whole ROS Stack is developed and tested on ROS **Melodic** which requires **Ubuntu 18.04** to run correctly. The using of another ROS version or OS may lead to malfunctions of some packages. Please follow the steps in :ref:`source/installation/ubuntu_18:Ubuntu 18 Installation` to install a working environment.
fr: L'ensemble de la stack ROS est développée et testée sur ROS **Melodic** qui nécessite **Ubuntu 18.04** pour fonctionner correctement. L'utilisation d'une autre version de ROS ou d'un autre système d'exploitation peut entraîner les dysfonctionnements de certains packages. Veuillez suivre les étapes indiquées dans :ref:`source/installation/ubuntu_18:Ubuntu 18 Installation` pour installer un environnement fonctionnel.

source: Simulation usage
fr: Utilisation de la simulation

source: Hardware features are simulated as if you were using a real robot.
fr: Les fonctionnalités materielles sont simulées comme si vous utilisiez un robot réel.

source: The data returned by the faked drivers is arbitrary and immutable. Among this data, you will have : voltage, temperature, error state (always 0), ping (always true), end effector state (immutable)
fr: Les données retournées par les drivers fictifs est arbitraire et immuable. Parmi ces données, vous trouverez : voltage, température, état d'erreur (toujours 0), ping (toujours vrai), état du end effector (immuable)

source: The simulation is a powerful tool allowing to test new programs directly on your computer which prevents to transfer new code on the robot.
fr: La simulation est un outil puissant qui permet de tester de nouveaux programmes directement sur votre ordinateur en évitant de transférer un nouveau code sur le robot.

source: It also helps for developing purpose → no need to transfer code, compile and restart the robot which is way slower than doing it on a desktop computer.
fr: Cela aide également à des fins de développement → aucun besoin de transférer du code, de compiler et de redémarrer le robot, ce qui est beaucoup plus lent que de le faire sur un ordinateur de bureau.

source: Without physics - No visualization
fr: Sans physique - Pas de Visualisation

source: This mode is mainly for simulation and tests purpose, bringing you in the closest state as possible to a real robot control. It is available for all currently supported architectures. You can access it by using the commands:
fr: Ce mode est principalement utilisé pour la simulation et les tests, vous rapprochant le plus possible du contrôle d'un robot réel. Il est disponible pour toutes les architectures actuellement supportées. Vous pouvez y accéder par la commande :

source: One simulation: ::
fr: Simulation du One : ::

source: Ned simulation: ::
fr: Simulation du One : ::

source: Ned2 simulation: ::
fr: Simulation du Ned2 : ::

source: This mode is useful if your CPU capacity is limited or if you don't have X server available.
fr: Ce mode est utile si vos capacités de calcul sont limitées ou si vous n'avez pas de serveur X disponible.

source: This mode is the more flexible one, as it provides all the possible options to customize the simulation. For the other simulation modes (with RViz and Gazebo) we will just force some of these parameters to specific values.
fr: Ce mode est le mode le plus flexible, car il procure toutes les options possibles pour personnaliser la simulation. Les autres modes de simulation (avec RViz et Gazebo), certains paramètres seront forcés à certaines valeurs.

source: Simulation without visualization Options
fr: Options de la simulation sans visualisation

source: Name
fr: Nom

source: Default Value
fr: Valeur par défaut

source: Log level to display for ROS loggers
fr: Niveau de log à afficher pour les loggeurs ROS

source: Enable or disable the TTL bus usage. This feature is used for debug mainly and can lead to an unstable stack.
fr: Active ou désactive l'usage du bus TTL. Cette fonctionnalité est principalement utilisée pour débugguer et peut mener à un fonctionnement instable de la stack.

source: Enable or disable the CAN bus usage. This feature is used for debug mainly and can lead to an unstable stack.
fr: Active ou désactive l'usage du bus CAN. Cette fonctionnalité est principalement utilisée pour débugguer et peut mener à un fonctionnement instable de la stack.

source: Launch in debug mode. For development and debug only.
fr: Lance la stack en mode debug. Pour le développement et le debugguage seulement.

source: Location of the version.txt file. A path to the file is required.
fr: Localisation du fichier version.txt. Un chemin vers ce fichier est requis.

source: Simulate the presence of a gripper id 11 on the bus
fr: Simule la présence d'un outil d'id 11 sur le bus

source: Simulate the presence of a conveyor (CAN for One and Ned, TTL for Ned2, based on configuration files) on the bus
fr: Siluma la présence d'un convoyeur (CAN pour le One et le Ned, TTL pour le Ned2, d'après les fichiers de configuration) sur le bus

source: Enable the Vision Kit
fr: Active le kit vision

source: Enable gazebo specific parameters (However it does not launch gazebo, use gazebo specific launch file for that)
fr: Active les paramètres dédiés à gazebo (Cependant cela ne lance pas gazebp, utilisez le fichier launch dédié à gazebo pour cela)

source: Without physics - RViz Visualization
fr: Sans physique - RViz Visualisation

source: A simple visualization of the robot is possible via a tool called Rviz. This application will simulate the robot with its correct geometry and positions but without physics to avoid using too much CPU.
fr: Une simple visualisation du robot est possible via un outil appelé RViz. Cette application va simuler le robot avec sa géométrie et ses positions correctes mais sans moteur physique pour éviter d'utiliser trop de processeur.

source: Control with trackbar
fr: Contrôler avec Trackbar

source: This visualization allows an easy first control of the robot, and helps to understand joints disposal. You can access it by using the command: ::
fr: Cette visualisation permet un premier contrôle facile du robot et aide à comprendre la position des axes. Utiliser la commande pour y accéder : ::

source: Rviz should open with a window containing 6 trackbars. Each of these trackbars allows to control the corresponding joint.
fr: Rviz doit s'ouvrir avec une fenêtre contenant 6 trackbars. Chacune de ces trackbars permet de contrôler l'axe correspondant.

source: Example of trackbars use.
fr: Exemple d'utilisation des trackbars.

source: Control with ROS
fr: Contrôler via ROS

source: Not only `Rviz <http://wiki.ros.org/rviz>`_ can display the robot, but it can also be linked with ROS controllers to show the robot's actions from ROS commands!
fr: Non seulement `RViz <http://wiki.ros.org/rviz>`_ peut afficher le robot, mais il peut également être lié aux contrôleurs ROS pour afficher les actions du robot à partir des commandes ROS !

source: This method can help you debug ROS topics, services and also, API scripts.
fr: Cette méthode peut aider à debugguer les topics et ervices ROS ainsi que les scripts des API.

source: To run it: ::
fr: Pour l'exécuter : ::

source: Rviz opening, with the robot ready to be controlled with ROS!
fr: L’ouverture de Rviz, avec le robot prêt à être contrôlé avec ROS !

source: RViz Visualization options
fr: Option de Visualisation RViz

source: Table of RViz launch Options
fr: Table des options de lancement de RViz

source: Use the parameters dedicated to this specific hardware_version. Possible values are "one", "ned" and "ned2"
fr: Utilise les paramètres dédiés à cette version matérielle. Les valeurs acceptées sont "one", "ned" et "ned2"

source: Enable the gui visualization
fr: Active la visualisation de l'interface graphique

source: Simulate the presence of a gripper id 11 on the bus (Visualisation of the tool will not be visible, whatever the value of this parameter)
fr: Simula la présence d'un outils d'id 11 sur le bus (l'outil ne sera cependant pas visible dans la visualisation, quelque soit la valeur de ce paramètre)

source: Simulate the presence of a conveyor (Visualisation of the conveyor will not be visible, whatever the value of this parameter)
fr: Simule la présence d'un convoyeur (le convoyeur ne sera cependant pas visible dans la simulation, quelque soit la valeur de ce paramètre)

source: With physics - Gazebo Simulation
fr: Sans physique - Simulation Gazebo

source: For the simulation, Ned uses Gazebo, a well known tool among the ROS community. It allows:
fr: Pour la simulation, Ned utilise Gazebo, un outil bien connu de la communauté ROS. Il permet :

source: Collision.
fr: La collision.

source: World creation → A virtual environment in which the robot can deal with objects.
fr: La création d’un monde → Un environnement virtuel dans lequel le robot peut manipuler des objets.

source: Gripper & Camera using.
fr: L’utilisation de la caméra et des Grippers.

source: The Niryo Gripper 1 has been replicated in Gazebo. The Camera is also implemented.
fr: Le Gripper Custom a été modélisé dans Gazebo. La caméra est également implémentée.

source: Gazebo also generates camera distortion, which brings the simulation even closer from the reality!
fr: Gazebo génère également une distorsion de la caméra, ce qui rapproche encore plus la simulation de la réalité !

source: Launch Gazebo simulation
fr: Lancer une simulation Gazebo

source: A specific world has been created to use Ned in Gazebo with 2 workspaces.
fr: Un monde spécifique a été créé pour utiliser Ned dans Gazebo avec 2 espaces de travail.

source: Gazebo view, with the robot ready to be controlled with ROS!
fr: Aperçu de Gazebo avec le robot prêt à être contrôlé avec ROS !

source: You can edit Gazebo world to do your own! It's placed in the folder *worlds* of the package niryo_robot_gazebo.
fr: Il est possible de modifier le monde Gazebo pour faire le vôtre ! Il est situé dans le dossier **mondes** du package niryo_robot_gazebo.

source: Gazebo Simulation options
fr: Option de simulation Gazebo

source: The user can disable 3 things by adding the specific string to the command line:
fr: L'utilisateur peut désactiver 3 choses en ajoutant la chaîne spécifique à la ligne de commande :

source: the Gazebo graphical interface: `gui:=false`.
fr: L'interface graphique Gazebo : `gui:=false`.

source: the Camera & the Gripper - Vision & Gripper wise functions won't be usable: `gripper_n_camera:=false`.
fr: La caméra et le Gripper - Les fonctions de vision et le Gripper ne seront pas utilisables : `gripper_n_camera:=false`.

source: Gazebo can be very slow. If your tests do not need Gripper and Camera, consider using Rviz to alleviate your CPU.
fr: Gazebo peut être très lent. Si vos tests ne nécessitent pas de Gripper ou de caméra, Il faut envisager d'utiliser Rviz pour alléger votre CPU.

source: Table of Gazebo launch Options
fr: Table des options de lancement de Gazebo

source: Simulate the presence of a gripper id 11 and a camera on the bus
fr: Simule la présence d'un outil d'id 11 sur le bus ainsi que de la caméra
