Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/stack/overview.po
Languages: fr

source: Overview
fr: Vue d'ensemble

source: Ned is a robot based on Raspberry, Arduino & ROS. It uses ROS to make the interface between Hardware and high-level bindings.
fr: Le Ned est un robot basé sur Raspberry Pi, Arduino et ROS. Il utilises ROS pour faire l'interface entre le materiel et les fonctions de haut niveau.

source: On the following figure, you can see a global overview of the Niryo's robot software in order to understand where are placed each part of the software.
fr: Sur la figure suivante, vous trouverez une vue globale de l'architecture logicielle du robot de Niryo, afin de mieux comprendre où sont définies chaque composants logiciels.

source: Niryo robot v3 software
fr: Niryo robot Logiciel V3

source: ROS Logo
fr: Logo ROS

source: ROS (Robot Operating System) is an Open-Source Robotic Framework which allows to ease robot software development. The framework is used in almost each part of Ned's software.
fr: ROS (Robot Operating System) est une infrastructure (Framework) robotique Open Source permettant de faciliter le développement logiciel des robots. Elle est utilisée dans presque tous les composants logiciels du Ned.

source: The Stack is split into two parts:
fr: La stack est divisée en deux parties :

source: The :doc:`high_level` (motion planner, vision, ...), developed in Python to give good readability
fr: La partie :doc:`high_level` (motion planner, vision, ...), développée en Python pour une meilleure lisibilité

source: The :doc:`low_level` (drivers, hardware management, ...), developed in C++ to ensure real time capabilities.
fr: La partie :doc:`low_level` (drivers, gestion matérielle, ...), développée en C++ pour assurer des performances temps réelles.

source: To learn more about ROS, go on `Official ROS Wiki <http://wiki.ros.org/>`_.
fr: Pour en savoir plus sur ROS, vous pouvez lire le `Wiki Officiel ROS <http://wiki.ros.org/>`_.
