Repository: twming/robotic_arm_niryo
Catalog: catkin_ws/src/sphinx_doc/locale/*/LC_MESSAGES/source/stack/high_level/niryo_robot_led_ring.po
Languages: fr

source: This package is the one managing the LED Ring of Ned2.
fr: Ce package permet de contrôler l'anneau LED du Ned2.

source: It is composed of one node, receiving commands and the current robot status, and publishing LED Ring states.
fr: Il est composé d'un nœud, recevant les commandes et l'état actuel du robot, et publiant les états de l'anneau LED.

source: The LED Ring is composed of 30 WS2811 RGB LEDs, controlled by the package with the `rpi_ws281x library <https://github.com/rpi-ws281x/rpi-ws281x-python>`_.
fr: Le LED Ring est composé de 30 LEDs RGB WS2811, contrôlées par le package grâce la bibliothèque `rpi_ws281x <https://github.com/rpi-ws281x/rpi-ws281x-"python>`_.

source: LED Ring node
fr: Nœud de l'anneau LED

source: The ROS Node is made to manage the LED Ring state, and to publish its currents status and state on ROS topics. It uses a class implementing several animation (11 for now), allowing to control the LED Ring or to display the current robot status. The LED Ring is also implemented in Rviz.
fr: Le nœud ROS est fait pour gérer l'état du LED Ring, et publie son état actuel sur un topic ROS. Il utilise une classe implémentant plusieurs animations, permettant de contrôler le LED Ring ou d'afficher l'état actuel du robot. L'anneau LED est également implémenté dans ``Rviz``.

source: The LED Ring can either be:
fr: L'anneau LED peut être :

source: in **ROBOT STATUS** mode: the LED is displaying the status of the robot.
fr: en mode **ROBOT STATUS** : la LED affiche l'état du robot.

source: in **USER** mode: the user can control the LED Ring with the several methods implemented, through
fr: En mode **USER** : l'utilisateur peut contrôler le LED Ring avec les différentes méthodes mises en œuvre, via :

source: `Blockly <https://docs.niryo.com/product/niryo-studio/v3.2.1/en/source/blockly_api.html>`_ , `Pyniryo <https://docs.niryo.com/dev/pyniryo/v1.0.5/en/index.html>`_ or :ref:`Python ROS Wrapper <source/python_ros_wrapper/ros_wrapper_doc:Python ROS Wrapper documentation>` .
fr: `Blockly <https://docs.niryo.com/product/niryo-studio/v3.2.1/en/source/blockly_api.html>`_ , `Pyniryo <https://docs.niryo.com/dev/pyniryo/v1.0.5/en/index.html>`_ ou :ref:`Python ROS Wrapper <source/python_ros_wrapper/ros_wrapper_doc:Python ROS Wrapper documentation>`.

source: Robot status mode
fr: Mode d'état du robot

source: When displaying the **robot status**, the LED Ring has several states which represent different modes and error status. Refer to the following table. The node subscribes to the ROS topic ``/niryo_robot_status/robot_status``, published by the package :ref:`RobotStatus<source/stack/high_level/niryo_robot_status:RobotStatus>`.
fr: Lors de l'affichage du **robot status**, l'anneau LED a plusieurs états qui représentent différents modes et états d'erreur. Reportez-vous au tableau suivant. Le nœud s'abonne au topic ROS ``/niryo_robot_status/robot_status``, publié par le package :ref:`RobotStatus<source/stack/high_level/niryo_robot_status:RobotStatus>`.

source: Animation and color
fr: Animation et couleur

source: Troubleshooting
fr: Dépannage

source: White :ref:`Breath <Breath>`
fr: :ref:`Breath <Breath>` blanc

source: Robot is booting
fr: Le robot démarre

source: Blue :ref:`Chase <Chase>`
fr: :ref:`Chase <Chase>` bleu

source: Calibration is needed
fr: Un étalonnage est nécessaire

source: Press the *Custom* button, or launch a calibration
fr: Appuyez sur le bouton *Custom*, ou lancez un étalonnage

source: Blue :ref:`Snake <Snake>`
fr: :ref:`Snake <Snake>` bleu

source: Calibration in progress
fr: Étalonnage en cours

source: Blue :ref:`Breath <Breath>`
fr: :ref:`Breath <Breath>` bleu

source: Free Motion enabled
fr: Mouvement libre activé

source: 3 Yellow :ref:`Flashing <Flashing>`
fr: 3 :ref:`clignottements <Flashing>` jaunes

source: Calibration start
fr: Début de l'étalonnage

source: Green :ref:`Breath <Breath>`
fr: :ref:`Breath <Breath>` vert

source: Free Motion disabled, torque enabled
fr: Free Motion désactivé, couple activé

source: :ref:`Solid <Solid>` Green
fr: Vert :ref:`fixe <Solid>`

source: Program in progress
fr: Programme en cours

source: Green :ref:`Chase <Chase>`
fr: :ref:`Chase <Chase>` vert

source: Program paused
fr: Programme suspendu

source: Long press on the TOP button to cancel the program, short press to resume
fr: Appui long sur le bouton sur haut du robot pour annuler le programme, appui court pour reprendre

source: Orange :ref:`Breath <Breath>`
fr: :ref:`Breath <Breath>` orange

source: Program execution error
fr: Erreur d'exécution du programme

source: Launch a new action to clear this state
fr: Lancer une nouvelle action pour effacer cet état

source: :ref:`Solid <Solid>` Orange
fr: Orange :ref:`fixe <Solid>`

source: Joint out of bounds
fr: Joint hors limites

source: Switch to Free Motion mode to bring the joints within limits.
fr: Passez en mode mouvement libre pour ramener les articulationsdans les limites.

source: 1 Purple :ref:`Flashing <Flashing>`
fr: 1 :ref:`clignottement <Flashing>` violet

source: New connection form Niryo Studio
fr: Nouveau formulaire de connexion Niryo Studio

source: 2 Purple :ref:`Flashing <Flashing>`
fr: 2 :ref:`clignottements <Flashing>` violets

source: Save a robot positions from the 'Save' button
fr: Enregistrer les positions d'un robot à partir du bouton 'Enregistrer'

source: :ref:`Flashing <Flashing>` Red
fr: :ref:`Flashing <Flashing>` rouge

source: Motor error / Raspberry overheating
fr: Erreur moteur / Surchauffe Raspberry

source: Please check the error on Niryo Studio.
fr: Veuillez vérifier l'erreur sur Niryo Studio.

source: :ref:`Solid <Solid>` Red
fr: Rouge :ref:`Fixe <Solid>`

source: ROS Crash
fr: Crash de ROS

source: Please restart the robot.
fr: Veuillez redémarrer le robot.

source: User mode
fr: Mode utilisateur

source: Several animations are implemented to allow the user different ways to control the LED Ring. Refer to the following table. The node receives commands through the service ``/niryo_robot_led_ring/set_user_animation`` (see :ref:`the service section<source/stack/high_level/niryo_robot_led_ring:Services - Led Ring>`)
fr: Plusieurs animations sont implémentées pour permettre à l'utilisateur différentes manières de contrôler le LED Ring. Reportez-vous au tableau suivant. Le nœud reçoit des commandes via le service ``/niryo_robot_led_ring/set_user_animation`` (voir :ref:`la section services <source/stack/high_level/niryo_robot_led_ring:Services - Led Ring>`)

source: Ned must be in autonomous mode in order to allow the user to control the LED Ring.
fr: Ned doit être en mode autonome afin de permettre à l'utilisateur de contrôler l'anneau LED.

source: Appearance
fr: Apparence

source: LEDs are turned off
fr: Les LEDs sont éteintes

source: Set the whole LED Ring to the same color at once
fr: Réglez l'ensemble de l'anneau LED sur la même couleur à la fois

source: Flashes a color according to a frequency
fr: Clignote une couleur selon une fréquence.

source: The different colors are alternated one after the other.
fr: Les différentes couleurs s'aleternent les unes après les autres.

source: Movie theater light style chase animation.
fr: Une LED sur trois est allumée. Toutes se décalent une LED après l’autre.

source: Wipe a color across the LED Ring.
fr: Allume les LEDs une à une jusqu'à allumer complètement l'anneau.

source: Similar to go_up, but LEDs are not turned off at the end.
fr: Similaire à *Go Up*, mais les LEDs ne sont pas éteintes à la fin.

source: Draws rainbow that fades across all LEDs at once.
fr: Dessine un arc-en-ciel qui s'estompe sur toutes les LED à la fois.

source: Draw rainbow that uniformly distributes itself across all LEDs.
fr: Dessine un arc-en-ciel qui se répartit sur toutes les LEDs.

source: Rainbow chase animation.
fr: Animation de *chase* arc-en-ciel.

source: LEDs turn on like a loading circle until lighting up the whole LED Ring.
fr: Les LEDs s'allument comme un cercle de chargement jusqu'à allumer tout l'anneau LED.

source: and are then all turned off at the same time.
fr: et sont ensuite tous éteints en même temps.

source: Like go_up, but LEDs are turned off the same way they are turned on.
fr: Comme *Go UP*, mais les LEDs sont éteintes de la même manière qu'elles sont allumées.

source: Variation of light intensity to imitate breathing.
fr: Variation de l'intensité lumineuse pour imiter la respiration.

source: Luminous snake that turns around the LED Ring.
fr: Serpent lumineux qui tourne autour de l'anneau LED.

source: When displaying the robot status, the LED Ring commander uses those methods, with the default parameters defined below.
fr: Lors de l'affichage de l'état du robot, le LED Ring commander utilise ces méthodes, avec les paramètres par défaut définis ci-dessous.

source: It belongs to the ROS namespace: |namespace_emphasize|.
fr: Il appartient à l'espace de noms ROS : |namespace_emphasize|.

source: Parameters - LED Ring
fr: Paramètres - Anneau LED

source: Firstly, the LED Ring component, controlled with the `rpi_ws281x library <https://github.com/rpi-ws281x/rpi-ws281x-python>`_, through the Python class PixelStrip, is parameterizable. Default parameters are set in the `led_strim_params.yaml` file of the `/config` folder of the package
fr: Tout d'abord, le composant LED Ring, contrôlé avec la librairie `rpi_ws281x <https://github.com/rpi-ws281x/rpi-ws281x-python>`_, via la classe Python PixelStrip. Les paramètres par défaut sont définis dans le fichier `led_strim_params.yaml` du dossier `/config` du package.

source: Parameters of the Led Ring component
fr: Paramètres du composant LED Ring

source: Name
fr: Nom

source: Default value
fr: Valeur par défaut

source: Number of LED pixels in the LED Ring
fr: Nombre de pixels LED dans l'anneau LED

source: Raspberry Pi GPIO pin connected to the pixels
fr: Pin de la Raspberry Pi connecté aux pixels

source: It must support PWM.
fr: Il doit prendre en charge PWM.

source: LED signal frequency in Hertz
fr: Fréquence du signal LED en Hertz

source: DMA channel to use for generating signal
fr: Canal DMA à utiliser pour générer un signal

source: ``led_brightness``
fr: ``led_luminosité``

source: LEDs brightness. Set to 0 for darkest and 255 for brightest
fr: Luminosité des LEDs. Réglé sur 0 pour le plus sombre et 255 pour le plus clair

source: True to invert the signal (when using NPN transistor level shift)
fr: True pour inverser le signal (lors de l'utilisation du décalage de niveau du transistor NPN)

source: the PWM channel to use
fr: le canal PWM à utiliser

source: Another configuration file, the `led_ring_params.yaml`, sets the default parameters of LED Ring animations.
fr: Un autre fichier de configuration, le `led_ring_params.yaml`, définit les paramètres par défaut des animations de l'anneau LED.

source: Parameters of the LED Ring animations
fr: Paramètres des animations de l'anneau LED

source: Default :ref:`Flashing <Flashing>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Flashing <Flashing>`

source: Default :ref:`Alternate <Alternate>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Alternate <Alternate>`.

source: Default :ref:`Chase <Chase>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Chase <Chase>`.

source: Default :ref:`Wipe <Color Wipe>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Wipe <Color Wipe>`.

source: Default :ref:`Rainbow <Rainbow>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Rainbow <Rainbow>`.

source: Default :ref:`Rainbow cycle <Rainbow cycle>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Rainbow cycle <Rainbow cycle>`

source: Default :ref:`Rainbow chase <Rainbow chase>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Rainbow chase <Rainbow chase>`

source: Default :ref:`Go up <Go up>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Go up <Go up>`.

source: Default :ref:`Go up and down <Go up and down>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Go up and down <Go up and down>`.

source: Default :ref:`Breath <Breath>` animation period in seconds
fr: Période par défault en secondes de l'animation :ref:`Breath <Breath>`.

source: Default :ref:`Snake <Snake>` animation period in seconds
fr: Période par défault en secondes de l'animationt :ref:`Snake <Snake>`.

source: Offset ID between the LED with the ID 0 and the ID of the LED at the back of the robot.
fr: ID de décalage entre la LED avec l'ID 0 et l'ID de la led à l'arrière du robot.

source: Rviz LED ring markers publishinf rate in simulation mode
fr: Taux de publication des marqueurs annulaires Rviz en mode simulation

source: Rviz LED ring markers publishing rate on a real robot
fr: Les marqueurs d'anneau à led Rviz publient le taux sur un robot real

source: Services - LED Ring
fr: Services - Anneau LED

source: The ROS node implements one service, designed for the user to control the LED Ring.
fr: Le nœud ROS implémente un service, conçu pour que l'utilisateur contrôle l'anneau LED.

source: LED Ring Package services
fr: Services du package d'anneau de LED

source: Allows user to control the LED Ring, with implemented animations. A new request
fr: Permet à l'utilisateur de contrôler l'anneau LED, avec des animations implémentées. Une nouvelle demande

source: will **interrupt** the previous one, if still playing. Depending on the ``wait`` boolean field
fr: va **interrompre** la précédente, si elle est toujours en cours de lecture. En fonction du champ booléen ``wait``

source: and the ``iterations`` field of the request, the service will either **answer immediately** after
fr: et le champ ``itérations`` de la requête, le service sera soit **répondre immédiatement** après

source: launching the animation, or **wait for the animation to finish** to answer.
fr: avoir lancé l'animation, ou **attendre que l'animation se termine** pour répondre.

source: Lights up a LED identified by an ID
fr: Allume une LED identifiée par un identifiant

source: Publishers - LED Ring
fr: Publishers - Anneau LED

source: LED Ring Package publishers
fr: Publishers du package d'anneau LED

source: Publishes the **status** of the LED Ring, providing information on the **current mode**
fr: Publie le **statut** du LED Ring fournissant des informations sur le **mode actuel**

source: (displaying robot status or controlled by user if the robot works in AUTONOMOUS mode),
fr: (affichage de l'état du robot ou contrôlé par l'utilisateur si le robot fonctionne en mode AUTONOME)

source: the **current animation played** and the animation color (except for rainbow methods, where
fr: l'**animation en cours jouée** et la couleur de l'animation (sauf pour les méthodes *Rainbow*, où

source: the animation color is not defined). Publishes every time at least **one field changed**.
fr: la couleur de l'animation n'est pas définie). Publie à chaque fois au moins **un champ modifié**.

source: Publishes shapes representing LEDs when Ned is used in simulation with **Rviz**,
fr: Publie des formes représentant des LEDs lorsque Ned est utilisé en simulation avec **Rviz**,

source: as a list of 30 :visualization_msgs:`visualization_msgs/Marker<Marker>` of size 30.
fr: sous forme de liste de 30 :visualization_msgs:`visualization_msgs/Marker<Marker>` de taille 30.

source: Subscribers - LED Ring
fr: Subscribers - Anneau LED

source: LED Ring Package subscribers
fr: Subscribers du package anneau LED

source: Topic name
fr: Nom du topic

source: Retrieves the current robot status, and control LED accordingly (see :ref:`Niryo_robot_status <source/stack/high_level/niryo_robot_status:Niryo_robot_status>` section)
fr: Récupère l'état actuel du robot et contrôle la LED en conséquence (voir la section :ref:`Niryo_robot_status <source/stack/high_level/niryo_robot_status:Niryo_robot_status>`)

source: Catches the 'Save Point' action to make the LED ring blink.
fr: Capturez l'action *Enregistrer le point* pour faire clignoter l'anneau LED.

source: :std_msgs:`std_msgs/Empty<Empty>`
fr: :std_msgs:`std_msgs/Vide<Vide>`

source: Catches the Niryo Studio connection to make the LED ring blink.
fr: Récupère la connection Niryo Studio pour faire clignotter l'anneau LED.

source: Dependencies - LED Ring
fr: Dépendances - Anneau LED

source: Services files - LED Ring
fr: Fichiers de service - Anneau LED

source: LED Ring API functions
fr: Fonctions de l'API de l'anneau LED

source: In order to control the robot more easily than calling each topics & services one by one, a Python ROS Wrapper has been built on top of ROS.
fr: Afin de contrôler le robot plus facilement que d'appeler chaqueTopic et Service un par un, un Python ROS Wrapper de ROS a été développé.

source: For instance, a script turning on the LED Ring via Python ROS Wrapper will look like: ::
fr: Par exemple, un script activant le LED Ring via Python ROS Wrapper ressemblera à : ::

source: This class allows you to control the robot via internal API. By controlling, we mean using the LED ring
fr: Cette classe vous permet de contrôler le robot via une API interne.

source: List of functions subsections:
fr: Liste des sous-sections de fonctions :

source: Custom animations functions
fr: Fonctions d'animations personnalisées

source: Lights up an LED in one colour. RGB colour between 0 and 255.
fr: Allume une LED d'une seule couleur. Couleur RVB entre 0 et 255.

source: Example: ::
fr: Exemple: ::

source: Parameters
fr: Paramètres

source: Id of the led: between 0 and 29
fr: Id de la led : entre 0 et 29

source: Led color in a list of size 3[R, G, B] or in an ColorRGBA object. RGB channels from 0 to 255.
fr: Couleur de la LED dans une liste de taille 3 [R, V, B] ou dansun objet ColorRGBA. Les canaux RVB ont une valeur comprise entre 0 et 255.

source: Returns
fr: Renvoie

source: Return type
fr: Type de retour

source: Sends a colour command to all LEDs of the LED ring. The function expects a list of colours for the 30 LEDs of the robot.
fr: Envoie une commande de couleur à toutes les LED de l'anneau LED.La fonction attend une liste de couleurs pour les 30 LED durobot.

source: List of size 30 of led color in a list of size 3[R, G, B] or in an ColorRGBA object. RGB channels from 0 to 255.
fr: Liste de taille 30 de couleur de led dans une liste de taille3[R, V, B] ou dans un objet ColorRGBA. Les canaux RVB ont une valeur comprise entre 0 et 255."

source: Pre-made animations functions
fr: Fonctions d'animations prédéfinies

source: Sets the whole Led Ring to a fixed color.
fr: Réglez l'ensemble de l'anneau LED sur une couleur fixe.

source: The service wait for the animation to finish or not to answer. For this method, the action is quickly done, so waiting doesn't take a lot of time.
fr: Le service attend que l'animation se termine ou ne réponde pas.Pour cette méthode, l'action se fait rapidement, donc l'attentene prend pas beaucoup de temps.

source: Turns off all Leds
fr: Éteignez toutes les LEDs

source: Flashes a color according to a frequency. The frequency is equal to 1 / period.
fr: Clignote une couleur selon une fréquence. La fréquence est égaleà 1/période.

source: Examples: ::
fr: Exemples: ::

source: Execution time for a pattern in seconds. If 0, the default time will be used.
fr: Temps d'exécution d'un motif en secondes. Si 0, la période par défautsera utilisée.

source: Number of consecutive flashes. If 0, the Led Ring flashes endlessly.
fr: Nombre de clignotements consécutifs. Si 0, la LED Ring clignotesans indéfiniment.

source: The service wait for the animation to finish all iterations or not to answer. If iterations is 0, the service answers immediately.
fr: Le service attend que l'animation termine toutes les itérationsou non pour répondre. Si le nombre d'itérations est à 0, le service répondimmédiatement.

source: Several colors are alternated one after the other.
fr: Plusieurs couleurs sont alternées les unes après les autres.

source: Led color list of lists of size 3[R, G, B] or ColorRGBA objects. RGB channels from 0 to 255.
fr: Liste des couleurs des leds des listes d'objets de taille 3[R,G, B] ou ColorRGBA. Les canaux RVB ont une valeur comprise entre 0 et 255.

source: Number of consecutive alternations. If 0, the Led Ring alternates endlessly.
fr: Nombre d'alternances consécutives. Si 0, le LED Ring alterneindéfiniment.

source: Movie theater light style chaser animation.
fr: Animation de Chase de style lumière de cinéma.

source: Number of consecutive chase. If 0, the animation continues endlessly. One chase just lights one Led every 3 Leds.
fr: Nombre de Chase consécutives. Si 0, l'animation continueindéfiniment. Un Chase allume juste une LED sur 3."

source: Wipes a color across the LED Ring, light a LED at a time.
fr: Essuyez une couleur sur l'anneau LED, allumez une LED à la fois.

source: The service wait for the animation to finish or not to answer.
fr: Le service attend que l'animation se termine ou ne réponde pas.

source: Number of consecutive rainbows. If 0, the animation continues endlessly.
fr: Nombre d'arcs-en-ciel consécutifs. Si 0, l'animation continueindéfiniment.

source: The service wait for the animation to finish or not to answer. If iterations is 0, the service answers immediately.
fr: Le service attend que l'animation se termine ou ne réponde pas.Si le nombre d'itérations vaut 0, le service est non bloquant.

source: Draws rainbow that uniformly distributes itself across all LEDs.
fr: Dessine un arc-en-ciel qui se répartit sur toutes les LEDs.

source: Number of consecutive rainbow cycles. If 0, the animation continues endlessly.
fr: Nombre de cycles arc-en-ciel consécutifs. Si 0, l'animation continueindéfiniment.

source: Rainbow chase animation, like the led_ring_chase method.
fr: Animation de Chase arc-en-ciel, comme la méthode led_ring_chase.

source: LEDs turn on like a loading circle, and are then all turned off at once.
fr: Les LED s'allument comme un cercle de chargement, puis s'éteignenttoutes en même temps.

source: Number of consecutive turns around the Led Ring. If 0, the animation continues endlessly.
fr: Nombre de tours consécutifs autour du LED Ring. Si 0, l'animationcontinue indéfiniment.

source: LEDs turn on like a loading circle, and are turned off the same way.
fr: Les LED s'allument comme un cercle de chargement et s'éteignentde la même manière.

source: Variation of the light intensity of the LED ring, similar to human breathing.
fr: Variation de l'intensité lumineuse de l'anneau LED, similaireà la respiration humaine.

source: A small coloured snake (certainly a python :D ) runs around the LED ring.
fr: Un petit serpent coloré (certainement un python :D ) se déplace autourde l'anneau LED.

source: Execution time for a pattern in seconds. If 0, the default duration will be used.
fr: Temps d'exécution d'un motif en secondes. Si 0, la durée pardéfaut sera utilisée.
