Repository: twming/robotic_arm_niryo
Catalog: catkin_ws/src/sphinx_doc/locale/*/LC_MESSAGES/source/stack/high_level/niryo_robot_bringup.po
Languages: fr

source: This packages provides config and launch files to start Ned and ROS packages with various parameters.
fr: Ce package fournit des fichiers de configuration et de lancement pour démarrer les packages Ned et ROS avec divers paramètres.

source: Launch files are placed in the *launch* folder. Only files with **.launch** extension can be executed.
fr: Les fichiers de lancement sont placés dans le dossier de *lancement*. Seuls les fichiers avec **.lancement** peuvent être exécutés.

source: Bring Up Launch Files' organization
fr: Organisation des fichiers de lancement Bring Up

source: On RaspberryPI
fr: Sur RasberryPI

source: The file **niryo_one_robot.launch** allows to launch ROS on a Raspberry Pi 3.
fr: Le fichier **niryo_one_robot.launch** permet de lancer ROS sur une Raspberry Pi 3.

source: This file is automatically launched when Niryo One boots (Niryo One RPi3B image).
fr: Ce fichier est automatiquement lancé au démarrage du Niryo One (image Niryo One RPi3B).

source: Command to launch Niryo One's ROS Stack::
fr: Commande pour lancer la stack ROS du Niryo One: ::

source: The file **niryo_ned_robot.launch** allows to launch ROS on a Raspberry Pi 4.
fr: Le fichier **niryo_ned_robot.launch** permet de lancer ROS sur une Raspberry Pi 4.

source: This file is automatically launched when Ned boots (Ned RPi4B image).
fr: Ce fichier est automatiquement lancé au démarrage de Ned (image Ned RPi4B).

source: Command to launch Ned's ROS Stack::
fr: Commande pour lancer la stack ROS de Ned : ::

source: The file **niryo_ned2_robot.launch** allows to launch ROS on a Raspberry Pi 4.
fr: Le fichier **niryo_ned2_robot.launch** permet de lancer ROS sur une Raspberry Pi 4.

source: This file is automatically launched when Ned2 boots (Ned2 RPi4B image).
fr: Ce fichier est automatiquement lancé au démarrage de Ned2 (image Ned2 RPi4B).

source: Command to launch Ned2's ROS Stack::
fr: Commande pour lancer la stack ROS de Ned2 : ::

source: On Desktop (Simulation)
fr: Sur le bureau (Simulation)

source: As the simulation happens on a computer, the hardware-related stuff is not used.
fr: Comme la simulation se produit sur un ordinateur, les éléments liés au matériel ne sont pas utilisés.

source: For both of following launch files, you can set:
fr: Pour les deux fichiers de lancement suivants, vous pouvez définir :

source: *gui* to "false" in order to disable graphical interface.
fr: *gui* à "false" pour désactiver l'interface graphique.

source: Gazebo simulation
fr: La simulation via Gazebo

source: Run Gazebo simulation. The robot can do everything that is not hardware-related:
fr: Exécuter la simulation Gazebo. Le robot peut faire tout ce qui n'est pas lié au matériel :

source: use the camera (to disable it, set "camera" parameter to 'false').
fr: Utiliser la caméra (pour la désactiver, régler le paramètre "caméra" sur 'faux').

source: use the Gripper 1 (to disable it, set "simu_gripper" parameter to 'false').
fr: Utilisez le Gripper Custom (pour le désactiver, définissez le paramètre "simu_gripper" sur 'faux').

source: save/run programs, go to saved pose, ...
fr: Enregistrer/exécuter des programmes, accéder à la pose enregistrée, ...

source: Command to launch the simulation: ::
fr: La commande pour lancer la simulation est : ::

source: To disable camera & gripper: ::
fr: La commande pour désactiver la caméra et le Gripper est : ::

source: To run it with a specific hardware version, use the command: ::
fr: La commande pour lancer la simulation est : ::

source: Rviz simulation
fr: La simulation via Rviz

source: Run Rviz simulation. You can access same features as Gazebo except Camera & Gripper.
fr: Exécuter la simulation Rviz. Il est possible d’accéder aux mêmes fonctionnalités que Gazebo, à l'exception de la caméra et du Gripper Custom.

source: To run it, use the command: ::
fr: La commande pour lancer la simulation est : ::

source: *niryo_robot_base* files setup many rosparams, these files should be launched before any other package.
fr: Les fichiers *niryo_robot_base* configurent de nombreux rosparams, ces fichiers doivent être lancés avant tout autre package.

source: The following files are used to configure the robot logs:
fr: Les fichiers suivants sont utilisés pour configurés les logs des robots:
