Repository: twming/robotic_arm_niryo
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/stack/low_level/cpu_interface.po
Languages: fr

source: This package provides an interface for CPU temperature monitoring.
fr: Ce package procure une interface pour la surveillance de la température des processeurs du système.

source: CPU Interface Node (For development and debugging purpose only)
fr: CPU Interface Node (pour le développement et le debuggage seulement)

source: This ROS Node has been conceived to launch the CPU interface in an isolated way.
fr: Ce noeud ROS a été conçu pour lancer l'interface CPU de manière isolée.

source: It is instantiated in :doc:`niryo_robot_hardware_interface` package.
fr: Il est instancié dans le package :doc:`niryo_robot_hardware_interface`.

source: It has been made to monitor CPU temperature of the Raspberry Pi and automatically shutdown the Raspberry Pi if it reaches a critical threshold. Two thresholds can be defined via parameters: a warning threshold and a shutdown threshold.
fr: Il a été conçu pour surveiller la température des processeurs et arrêter automatiquement la Raspberry Pi si celle-ci atteint un seuil critique. Deux seuils peuvent être définis via des paramètres : un seuil d'alerte et un seuil d'arrêt.

source: The CPU temperature is read from the Ubuntu system file */sys/class/thermal/thermal_zone0/temp*.
fr: La température des processeurs est lue depuis le fichier système d'Ubuntu */sys/class/thermal/thermal_zone0/temp*.

source: In simulation, the CPU temperature of the computer running the simulation is used, but the threshold are deactivated (no shutdown in case of high temperature).
fr: En simulation, la température des processeurs de l'ordinateur faisant tourner la simulation est utilisées, mais les seuils sont désactivés (pas d'arrêt en cas de température trop élevée).

source: It belongs to the ROS namespace: |namespace_emphasize|.
fr: Il appartient au namespace ROS : |namespace_emphasize|.

source: Parameters
fr: Paramètres

source: CPU Interface's Parameters
fr: Paramètres de l'interface

source: Name
fr: Nom

source: Publishes rate for CPU temperature
fr: Fréquence de publication de la température des processeurs

source: Default: '0.25'
fr: Défaut : '0.25'

source: CPU temperature [celsius] threshold before a warn message
fr: Seuil de température des processeurs [celsius] avant d'envoyer un message d'alerte

source: Default: '75'
fr: Défaut : '75'

source: CPU temperature [celsius] threshold before shutdown the robot
fr: Seuil de température des processeurs [celsius] avant d'éteindre le robot

source: Default: '85'
fr: Défaut : '85'

source: Dependencies
fr: Dépendances

source: Services, Topics and Messages
fr: Services, Topics et Messages

source: None
fr: Aucun
