Repository: twming/robotic_arm_niryo
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/stack/low_level/end_effector_interface.po
Languages: fr

source: This package handles the End Effector Panel of a robot, it is supported from Ned 2.
fr: Ce package prend en charge le panel End Effector d'un robot, il est supporté à partir du Ned2.

source: It provides services and topics specific to the End Effector Panel in order to be used by a final user.
fr: Il expose des services et topics spéciques au panel End Effector pour être utilisé par un utilisateur final.

source: However, it does not deal with the low level bus communication with the components: this is done in the :doc:`ttl_driver` package.
fr: Cependant, il ne gère pas la partie bas niveau de communication sur le bus avec les composants : c'est fait dans le package :doc:`ttl_driver`.

source: End Effector Interface node (For development and debug)
fr: Node End Effector Interface (pour le développement et le debugguage)

source: The ROS Node in End Effector Interface Package is used to:
fr: Le Node ROS dans le package End Effector Interface est utilisé pour :

source: Instantiate a :doc:`ttl_driver` manager to communicate with hardware.
fr: Instancier un manager :doc:`ttl_driver` pour communiquer avec le matériel.

source: Initialize End Effector Interface.
fr: Initialiser l'interface End Effector.

source: It is instantiated in :doc:`niryo_robot_hardware_interface` package.
fr: Il est instancié dans le package :doc:`niryo_robot_hardware_interface`.

source: It has been conceived to:
fr: Il a été conçu pour :

source: Interface with TTL Driver.
fr: S'interfacer avec le Driver TTL.

source: Initialize End Effector parameters.
fr: Initialiser les paramètres du End Effector.

source: Retrieve End Effector data from TTL driver.
fr: Récupérer les données du End Effector depuis le driver TTL.

source: Publish the status of buttons.
fr: Publier le statu des boutons.

source: Publish the collision detection status.
fr: Publier le statut de la détection de collision.

source: Start service on IO State.
fr: Démarrer le service d'état des IO.

source: It belongs to the ROS namespace: |namespace_emphasize|.
fr: Il appartient au namespace ROS : |namespace_emphasize|.

source: Parameters - End Effector Interface
fr: Paramètres - End Effector Interface

source: end_effector_interface's Parameters
fr: Paramètres de end_effector_interface

source: Name
fr: Nom

source: Id of the End Effector in TTL bus
fr: Id de l'End Effector sur le bus TTL

source: Default: 0
fr: Défaut: 0

source: Frequency to get the End Effector from driver
fr: Fréquence de reception des données du End Effector depuis le driver

source: Default: 40.0
fr: Défaut: 40.0

source: Button used to activate the FreeMotion mode
fr: Bouton utilisé pour activer le mode FreeMotion

source: Default: free_drive
fr: Défaut: free_drive

source: Button used to save the actual position of the robot
fr: Bouton utilisé pour sauver la position courante du robot

source: Default: save_position
fr: Défaut: save_position

source: Custom Button used by users to do something
fr: Bouton personnalisé utilisé par les utilisateurs pour faire l'action de leur choix

source: Default: custom
fr: Défaut: custom

source: Type of the End Effector. It can be end_effector or fake_end_effector
fr: Type de l'End Effector. Les valeurs possibles sont : end_effector ou fake_end_effector

source: Default: end_effector
fr: Défaut: end_effector

source: Published topics - End Effector Interface
fr: Topics publiés - End Effector Interface

source: end_effector_interface Package Published Topics
fr: Topics publiés du package end_effector_interface

source: Message Type
fr: Type de message

source: Publishes state of Free Motion Button
fr: Publie l'état du bouton FreeMotion

source: Publishes state of Save Position Button
fr: Publie l'état du bouton Save Position

source: Publishes state of Custom Button
fr: Publie l'état du bouton Custom

source: Publishes state of IO Digital
fr: Publie l'état du Digital IO

source: end_effector_interface Package Services
fr: Services du package end_effector_interface

source: Service Type
fr: Type de service

source: Set up digital output on End Effector
fr: Initialise la sortie digitale du End Effector

source: Dependencies - End Effector Interface
fr: Dépendances - End Effector Interface

source: Services & Messages files - End Effector Interface
fr: Fichiers de Services et de Messages - End Effector Interface
