Repository: twming/robotic_arm_niryo
Catalog: catkin_ws/src/sphinx_doc/locale/*/LC_MESSAGES/source/stack/low_level/can_driver.po
Languages: fr

source: CAN Driver
fr: Driver CAN

source: This package provides an interface between high level ROS packages and handler of CAN Bus. It uses the mcp_can_rpi for CAN bus communication.
fr: Ce package procure une interface entre les packages ROS haut niveau et le

source: It is used by only Ned and the Niryo One.
fr: Utilisé uniquement par le Ned et le One.

source: CAN Driver Node (For only the development and debugging propose)
fr: CAN Driver Node (Uniquement pour du développement ou du debuguage)

source: The ROS Node is made to:
fr: Le Node ROS est conçu pour :

source: Initialize CAN Interface.
fr: Initialiser l'interface CAN.

source: It is instantiated in :doc:`niryo_robot_hardware_interface` package.
fr: Il est instancié dans le package :doc:`niryo_robot_hardware_interface`

source: It has been conceived to:
fr: Il a été conçu pour :

source: Initialize the CAN Interface and physical bus with the configurations.
fr: Initialiser l'interface CAN et le bus physique avec les configurations.

source: Add, remove and monitor devices on bus.
fr: Ajouter, enlever et surveiller les périphériques sur le bus.

source: Start control loop to get and send data from/to motors.
fr: Démarrer la boucle de contrôle pour récupérer et envoyer des données depuis/vers les moteurs.

source: Start ROS stuffs like services, topics if they exist.
fr: Démarrer les services et topics ROS s'ils existent.

source: It belongs to the ROS namespace: |namespace_emphasize|.
fr: Il appartient au namespace ROS |namespace_emphasize|.

source: Parameters
fr: Paramètres

source: These configuration parameters are set to work with Niryo's robot. Do not edit them.
fr: Ces paramètres de configuration ont été étudiés pour faire fonctionner les robots de Niryo de manière optiomale. Il est fortement déconseillé de les éditer.

source: CAN Driver's Parameters
fr: Paramètres du driver CAN

source: Name
fr: Nom

source: Control loop frequency.
fr: Frequence de la boucle de contrôle.

source: Default: '1500.0'
fr: Défaut: '1500.0'

source: Write frequency.
fr: Fréquence d'écriture.

source: Default: '200.0'
fr: Défaut: '200.0'

source: Read frequency.
fr: Fréquence de lecture.

source: Default: '50.0'
fr: Défaut: '50.0'

source: spi channel.
fr: Canal spi (Serial Peripheral Interface) utilisé pour le bus CAN.

source: Default: '0'
fr: Défaut: '0'

source: Baudrate.
fr: Débit en baud.

source: Default: '1000000'
fr: Défaut: '1000000'

source: GPIO Interrupt.
fr: Pin d'interruption GPIO.

source: Default: '25'
fr: Défaut: '25'

source: Dependencies
fr: Dépendances

source: Services, Topics and Messages
fr: Services, Topics et Messages
