Repository: twming/robotic_arm_niryo
Catalog: catkin_ws/src/sphinx_doc/locale/*/LC_MESSAGES/source/stack/low_level/conveyor_interface.po
Languages: fr

source: Conveyor Interface
fr: Interface Convoyeur

source: This package handles Niryo's Conveyors.
fr: Ce package gère les convoyeurs Niryo.

source: It allows you to control up to two Conveyors at the same time.
fr: Il vous permet de contrôler jusqu'à deux Convoyeurs en même temps.

source: Two version of the conveyor exist: The Conveyor Belt, communicating via a CAN bus, and the Conveyor Belt (V2), communicating via a TTL bus. Both of them are directly compatible for the Ned and One. For Ned2, you will need to change the stepper card of the CAN Conveyor Belt to be able to use it on a TTL port (there is no CAN port on Ned2).
fr: Deux versions du convoyeur existes: Le convoyeur v1, qui communique à travers un bus CAN et le convoyeur v2, qui communique à travers un bus TTL. Les deux sont entièrement compatible avec le Ned et le NiryoOne. Pour le Ned2, vous aurez besoin de changer la carte stepper du convoyeur belt v1 pour qu'il soit compatible; le Ned2 n'ayant pas de port CAN disponible de base.

source: Conveyor Interface node (For development and debugging purpose only)
fr: Conveyor Interface Node (pour le développement et le debugguage seulement)

source: This ROS Node has been conceived to:
fr: The Node ROS a été conçu pour :

source: Use the correct low level driver according to the hardware version of the robot.
fr: Utiliser le bon driver bas niveau, selon la version matérielle du robot.

source: Initialize the Conveyor Interface.
fr: Initialiser l'interface du Convoyeur.

source: Conveyor Interface core
fr: Convoyeur Interface Core

source: It is instantiated in :doc:`niryo_robot_hardware_interface` package.
fr: Il est instancié dans le package :doc:`niryo_robot_hardware_interface`.

source: It has been conceived to:
fr: The Node ROS a été conçu pour :

source: Interface itself with low level drivers (CAN or TTL for Ned and Niryo One, TTL only for Ned2)
fr: S'interfacer avec les drivers bas niveau (CAN ou TTL pour Ned et le Niryo One, TTL uniquement pour le Ned2

source: Initialize conveyor motors parameters.
fr: Initialiser l'interface du Convoyeur.

source: Handle the requests from services to set, control or remove the conveyors.
fr: Gérer les requêtes depuis les services pour installer, contrôler ou retirer les convoyeurs.

source: Publish conveyor states.
fr: Fréquence de publication pour les états des convoyeurs.

source: It belongs to the ROS namespace: |namespace_emphasize|.
fr: Il appartient au namespace ROS : |namespace_emphasize|.

source: Parameters
fr: Paramètres

source: Conveyor Interface's Parameters
fr: Paramètres de l'interface Convoyeur

source: Name
fr: Nom

source: Publishing rate for conveyors state.
fr: Fréquence de publication pour les états des convoyeurs.

source: Default: '2.0'
fr: Défaut : '2.0'

source: Type of the motor used.
fr: Type de moteur utilisé.

source: Default: 'Stepper'
fr: Défault: 'Stepper'

source: Protocol of the communication.
fr: Protocole de communication.

source: It can be 'CAN' (for Ned or One) or 'TTL' (for Ned or One or Ned 2)
fr: Peut être 'CAN' (pour Ned ou le One) ou 'TTL' (pour Ned ou le One ou le Ned2)

source: Default id of the conveyor before the connection.
fr: Identifiant (id) par défaut pour le convoyeur avant la connexion.

source: Id of the conveyor after the connection.
fr: Identifiant du convoyeur après la connexion.

source: Direction of the conveyor.
fr: Direction du convoyeur.

source: ``max_effort`` (CAN Only)
fr: ``max_effort`` (CAN seulement)

source: Max effort used by the steppers
fr: Effort maximal des moteurs stepper

source: Default: '90'
fr: Défaut: '90'

source: ``micro_steps`` (CAN only)
fr: ``micro_steps`` (CAN seulement)

source: Micro steps used by the Steppers
fr: Micro steps utilisés par les moteurs steppers

source: Default: '8'
fr: Défault : '8'

source: Published topics - Conveyor interface
fr: Topics publiés - Conveyor Interface

source: Conveyor Interface's Published Topics
fr: Liste des topics publiés par le Conveyor Interface

source: Message Type
fr: Type de Message

source: Conveyors states
fr: Etats des convoyeurs

source: Conveyor Interface Package Services
fr: Services du package Interface Convoyeur

source: Sends a command to the desired Conveyor
fr: Envoie une commande au convoyeur choisi

source: Scans and sets a new Conveyor or removes a connected Conveyor
fr: Scan et connecte un nouveau Convoyeur ou supprime un Convoyeur connecté

source: Dependencies - Conveyor interface
fr: Dépendances - Convoyeur Interface

source: Services & messages files - Conveyor interface
fr: Files de Services et messages - Conveyor interface

source: ControlConveyor (Service)
fr: : |namespace_emphasize|

source: SetConveyor (Service)
fr: : |namespace_emphasize|

source: ConveyorFeedbackArray (Message)
fr: : |namespace_emphasize|

source: ConveyorFeedback (Message)
fr: : |namespace_emphasize|
