Repository: twming/robotic_arm_niryo
Catalog: catkin_ws/src/sphinx_doc/locale/*/LC_MESSAGES/source/stack/low_level/tools_interface.po
Languages: fr

source: This package handles Niryo's tools.
fr: Ce package est dédié à la gestion des outils Niryo.

source: Tools interface node (For Development and Debugging)
fr: Node Tools Interface (Pour le développement et le debuguage)

source: The ROS Node is made to:
fr: Ce noeud ROS est conçu pour :

source: Initialize Tool Interface with configuration parameters.
fr: Initialiser l'interface Tool Interface avec les paramètres de configuration.

source: Start ROS stuffs like services, topics.
fr: Démarrer les services et topics ROS.

source: It is instantiated in :doc:`niryo_robot_hardware_interface` package.
fr: Il est instancié dans le package :doc:`niryo_robot_hardware_interface`.

source: It has been conceived to:
fr: Il a été conçu pour :

source: Initialize the Tool Interface.
fr: Initialiser le Tool Interface.

source: Provide services for setting and controlling tools.
fr: Procurer les services pour configurer et contrôler les outils.

source: Publish tool connection state.
fr: Publier l'état de connexion des outils.

source: It belongs to the ROS namespace: |namespace_emphasize|.
fr: Il appartient au namespace ROS : |namespace_emphasize|.

source: Tool Interface's default Parameters
fr: Paramètres par défaut de Tool Interface

source: Name
fr: Nom

source: The frequency where tool interface check and publish the state of the tool connected,
fr: Fréquence de vérification et de publication de l'état de l'outil connecté,

source: or remove tool if it is disconnected.
fr: ou enlève l'outil si il est déconnecté.

source: Default: '2.0'
fr: Défaut: '2.0'

source: Tool Interface's hardware specific Parameters
fr: Paramètres spécifiques à la version matérielle du robot

source: These parameters are specific to the hardware version (Ned, One or Ned2). This file comes in a different version for each hardware version, located in a directory of the hardware version name.
fr: Ces paramètres sont spécifiques à la version matérielle (Ned, Niryo One ou Ned2). Ces fichiers sont présents en versions différentes pour chaque version matérielle. Ils sont situés dans un dossier du nom de la version matérielle.

source: Supported Hardware versions
fr: Versions Matérielles supportées

source: List of default IDs of each tool supported by Niryo
fr: Liste des Ids par défaut de chaque outil supporté par Niryo

source: Default: '[11,12,13,30,31]'
fr: Défaut: '[11,12,13,30,31]'

source: All Versions
fr: Toutes les versions

source: List of motor tools type
fr: Liste des types de moteurs pour les outils

source: Default: 'xl320' for NED and ONE
fr: Défaut: 'xl320' pour le Ned et le One

source: Default: 'xl330' for NED2
fr: Défaut: 'xl330' pour le Ned2

source: Default: 'fakeDxl' for simulation
fr: Défaut: 'fakeDxl' pour la simulation

source: List of tools's name corresponds to ID list and type list above
fr: Liste des noms d'outils correspondant à la liste des ids et des types ci-dessus

source: Default: '["Standard Gripper", "Large Gripper", "Adaptive Gripper", "Vacuum Pump", "Electromagnet"]'
fr: Défaut: '["Standard Gripper", "Large Gripper", "Adaptive Gripper", "Vacuum Pump", "Electromagnet"]'

source: Dependencies
fr: Dépendances

source: Services, Topics and Messages
fr: Services, Topics et Messages

source: Published topics
fr: Topics publiés

source: Tools Interface's Published Topics
fr: Topics publiés de Tool Interface

source: Message Type
fr: Type de message

source: Current tool ID
fr: Identifiant de l'outil actuel

source: Tool Interface Package Services
fr: Services du package Tool Interface

source: Scans and sets for a tool plugged
fr: Scanne et configure un outil connecté

source: Opens the gripper
fr: Ouvre la pince

source: Closes the gripper
fr: Ferme la pince

source: Pulls air with the vacuum pump
fr: Aspire l'air avec la pompe à vide

source: Pushes air with the vacuum pump
fr: Souffle de l'air avec la pompe à vide

source: Reboots the motor of the equipped tool
fr: Redémarre le moteur de l'outil équipé
