Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/python_ros_wrapper/examples_movement.po
Languages: fr

source: Examples: Movement
fr: Exemples : Les mouvements

source: This document shows how to control Ned in order to make Move Joints & Move Pose.
fr: Ce document montre comment contrôler Ned afin de déplacer les axes et de changer la position de Ned.

source: If you want see more, you can look at :ref:`API - Joints & Pose<source/python_ros_wrapper/ros_wrapper_doc:Joints & Pose>`.
fr: Si vous désirez en voir davantage, vous pouvez regarder la rubrique :ref:`API - Joints & Pose<source/python_ros_wrapper/ros_wrapper_doc:Joints & Pose>`.

source: If you are using the real robot, make sure the environment around is clear.
fr: Si vous utilisez le vrai robot, assurez-vous que l'environnement autour est dégagé.

source: Joints
fr: Axes

source: To do a moveJ, you should pass 6 floats: (j1, j2, j3, j4, j5, j6) to the method :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_joints`: ::
fr: Pour effectuer un moveJ (déplacement d'axes), il est nécessaire de passer 6 floats : (j1, j2, j3, j4, j5, j6) vers la méthode :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_joints` : ::

source: To get joints, we use :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.get_joints`: ::
fr: Pour obtenir les axes, il faut utiliser :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.get_joints` : ::

source: Pose
fr: Position

source: To do a moveP, you should pass 6 floats: (x, y, z, roll, pitch, yaw) to the method :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_pose`.
fr: Pour effectuer un moveP, Il est nécessaire de passer 6 floats : (x, y, z, roll, pitch, yaw) à la méthode :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_pose`.

source: See on this example: ::
fr: Voir l'exemple ci-dessous : ::

source: To get pose, we use :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.get_pose`: ::
fr: Pour obtenir les positions, il faut utiliser :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.get_pose`: ::
