Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/python_ros_wrapper/examples_basics.po
Languages: fr

source: Examples: Basics
fr: Exemples : Les principes de base

source: In this file, two short programs are implemented & commented in order to help you understand the philosophy behind the Python ROS Wrapper.
fr: Dans ce fichier, deux programmes courts sont implémentés et commentés afin de vous aider à comprendre la philosophie derrière Python ROS Wrapper.

source: If you are using the real robot, make sure the environment around is clear.
fr: Si vous utilisez le vrai robot, assurez-vous que l'environnement autour est dégagé.

source: Your first move joint
fr: Votre premier mouvement d'axes

source: The following example shows a first use case. It's a simple MoveJ. ::
fr: L'exemple suivant montre un premier cas d'utilisation. C’est un simple MoveJ. ::

source: Code details - First MoveJ
fr: Détails du code - Premier MoveJ

source: First of all, we indicate to the shell that we are running a Python Script: ::
fr: Tout d'abord il faut indiquer au système que nous exécutons un script Python : ::

source: Then, we import the API package to be able to access functions: ::
fr: Ensuite, nous importons le package API pour pouvoir accéder aux fonctions : ::

source: Then, we install a ROS Node in order to communicate with ROS master: ::
fr: Ensuite, il est nécessaire d'installer un nœud ROS afin de communiquer avec le ROS master : ::

source: We start a :class:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper` instance: ::
fr: Nous lançons une instance :class:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper` : ::

source: Once the connection is done, we calibrate the robot using its :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.calibrate_auto` function: ::
fr: Une fois la connexion établie, nous calibrons le robot à l'aide de sa fonction :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.calibrate_auto` : ::

source: As the robot is now calibrated, we can do a Move Joints by giving the 6 axis positions in radians! To do so, we use :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_joints`: ::
fr: Maintenant que le robot est calibré, nous pouvons faire un déplacement d'axes en donnant les 6 positions des axes en radians. Pour ce faire, nous utilisons :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_joints`: ::

source: Your first pick and place
fr: Votre premier pick and place

source: For our second example, we are going to develop an algorithm of pick and place: ::
fr: Pour notre deuxième exemple, nous allons développer un algorithme de pick and place : ::

source: Code details - first pick and place
fr: Détails du code - Premier pick and place

source: First of all, we do the imports and start a ROS Node: ::
fr: Tout d'abord, il faut effectuer les importations et démarrer un nœud ROS :

source: Then, create a :class:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper` instance & calibrate the robot: ::
fr: Ensuite, il est nécessaire de créer une instance :class:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper` et de calibrer le robot : ::

source: Then, we equip the tool with :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.update_tool` ::
fr: Ensuite, il vous faut équiper l'outil avec :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.update_tool` : ::

source: Now that our initialization is done, we can open the Gripper (or push air from the Vacuum pump) with :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.release_with_tool`, go to the picking pose via :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_pose` & then catch an object with :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.grasp_with_tool`! ::
fr: Maintenant que notre initialisation est terminée, nous pouvons ouvrir le Gripper (ou activer la Pompe à vide) avec :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.release_with_tool`, aller à la position de picking via :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.move_pose` et ensuite attraper l'objet avec :meth:`~.niryo_robot_python_ros_wrapper.ros_wrapper.NiryoRosWrapper.grasp_with_tool` ! ::

source: We now get to the place pose, and place the object. ::
fr: Nous voilà maintenant en position finale (place position) et le robot prêt à placer l'objet. ::

source: Notes - Basics examples
fr: Notes - Exemples basiques

source: You may not have fully understood how to move the robot and use tools of Ned and that is totally fine because you will find more details on another examples page!
fr: Si vous n'avez pas bien compris comment déplacer le robot et utiliser les outils de Ned, c'est tout à fait normal. Vous trouverez plus de détails sur les autres pages d'exemples !

source: The important thing to remember from this page is how to import the library & connect to the robot.
fr: La chose importante à retenir de cette page est de savoir comment importer la bibliothèque et de se connecter au robot.
