Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/python_ros_wrapper/ros_wrapper_doc.po
Languages: fr

source: Python ROS Wrapper documentation
fr: Documentation Python ROS Wrapper

source: This file presents the different Functions, Classes & Enums available with the API.
fr: Ce fichier présente les différentes fonctions, classes et énumérations disponibles avec l'API.

source: API functions
fr: Les fonctions de l'API

source: This class allows you to control the robot via internal API. By controlling, we mean:
fr: Cette classe vous permet de contrôler le robot via l'API interne. Par le terme contrôler, nous signifions :

source: Moving the robot.
fr: Changer la position du robot.

source: Using Vision.
fr: Utiliser la Vision.

source: Controlling Conveyors Belt.
fr: Contrôler le Convoyeur.

source: Playing with hardware.
fr: Jouer avec du matériel.

source: List of functions subsections:
fr: Liste des sous-sections des fonctions :

source: Main purpose functions
fr: Fonctions majeures

source: Calls service to calibrate motors then waits for its end. If failed, raises NiryoRosWrapperException
fr: Appelle le service pour calibrer les moteurs, puis attend que la calibration soit terminée. Si ce n'est pas réussi, soulève une exception NiryoRosWrapperException

source: Returns
fr: Renvoie

source: status, message
fr: Statut, message

source: Return type
fr: Type renvoyé

source: Uses /niryo_robot/learning_mode/state topic subscriber to get learning mode status
fr: Utilise /niryo_robot/learning_mode/state topic subscriber pour obtenir le statut du mode apprentissage

source: ``True`` if activate else ``False``
fr: ``True`` si activé, sinon ``False``

source: Calsl service to set_learning_mode according to set_bool. If failed, raises NiryoRosWrapperException
fr: Appelle le service set_learning_mode pour activer ou désactiver le mode apprentissage en fonction de set_bool. Si échec, soulève une exception NiryoRosWrapperException

source: Parameters
fr: Paramètre

source: ``True`` to activate, ``False`` to deactivate
fr: ``True`` pour activer, ``False`` pour désactiver

source: Sets relative max velocity (in %)
fr: Définir la vitesse relative maximum (en %)

source: Percentage of max velocity
fr: Pourcentage de la vitesse maximum

source: Joints & Pose
fr: Axe et Pose

source: Uses /joint_states topic to get joints status
fr: Récupération de la valeurs des axes via le topic /joint_states

source: list of joints value
fr: Liste des valeurs des axes

source: Uses /niryo_robot/robot_state topic to get pose status
fr: Récupération de la position de l'effecteur via le topic /niryo_robot/robot_state

source: RobotState object (position.x/y/z && rpy.roll/pitch/yaw && orientation.x/y/z/w)
fr: Objet RobotState [position.x/y/z ; rpy.rool/pitch/yaw ; orientation.x/y/z]

source: list corresponding to [x, y, z, roll, pitch, yaw]
fr: Une liste correspondant à [x, y, z, roll, pitch, yaw]

source: Executes Move joints action
fr: Réalise une action de mouvement d'axes

source: Moves to Sleep pose which allows the user to activate the learning mode without the risk of the robot hitting something because of gravity
fr: Déplace le robot à la position de repos ce qui permet d'activer le mode apprentissage sans risque que le robot touche quelque chose

source: Moves robot end effector pose to a (x, y, z, roll, pitch, yaw) pose, in a particular frame if defined
fr: Déplace l'effecteur à la position [x, y, z, roll, pitch, yaw], dans un repère particulier si précisé

source: Executes Shift pose action
fr: Réalise une action de déplacement de l'effecteur par glissement

source: Value of RobotAxis enum corresponding to where the shift happens
fr: Valeur de l'énumérations correspondant à l'axe de glissement

source: shift value
fr: Valeur du glissement

source: Executes Shift pose action with a linear trajectory
fr: Réalise un glissement de façon linéaire

source: Moves robot end effector pose to a (x, y, z, roll, pitch, yaw) pose, with a linear trajectory, in a particular frame if defined
fr: Déplacement de l'effecteur du robot à la posistion [x, y, z, roll, pitch, yaw] suivant une trajectoire linéaire, dans un repère particulier si précisé

source: Turns jog controller On or Off
fr: Active ou désactive le controle direct

source: ``True`` to turn on, else ``False``
fr: ``True`` quand activé, ``False`` sinon

source: Makes a Jog on joints position
fr: Réalise un control directe sur la position des axes

source: list corresponding to the shift to be applied to each joint
fr: La liste correspondant au déplacement à appliquer à chaque axe

source: Makes a Jog on end-effector position
fr: Réalise un control direct sur la position de l'effecteur

source: list corresponding to the shift to be applied to the position
fr: La liste correspondant au déplacement à appliquer à la position

source: Computes forward kinematics
fr: Calcule la cinématique directe

source: Computes inverse kinematics
fr: Calcule la cinématique inverse

source: Saved poses
fr: Positions sauvegardées

source: Moves robot end effector pose to a pose saved
fr: Déplace l'éffecteur du robot à une position sauvegardées

source: Gets saved pose from robot intern storage Will raise error if position does not exist
fr: Récupération des position sauvegardées dans le robot. Renvoie une erreur si la position n'existe pas

source: Pose Name
fr: Nom de la position

source: x, y, z, roll, pitch, yaw
fr: x, y, z, roulis, tangage, lacet

source: Saves pose in robot's memory
fr: Sauvegarde de la position dans le robot

source: Sends delete command to the pose manager service
fr: Supprime la position

source: Asks the pose manager service which positions are available
fr: Renvoie la liste des positions sauvegardées et leur description

source: If True it returns the poses descriptions
fr: Si Vrai renvoie les descriptions des positions

source: list of positions name
fr: La liste des noms des positions

source: Executes a picking from a position. If an error happens during the movement, error will be raised A picking is described as : - going over the object - going down until height = z - grasping with tool - going back over the object
fr: Réalise un prélèvement depuis une position. Un prélèvement est décrit comme : - aller au dessus de l'objet - descendre jusqu'à l'hauteur z - attraper avec l'outil - retourner au dessus de l'objet

source: Executes a placing from a position. If an error happens during the movement, error will be raised A placing is described as : - going over the place - going down until height = z - releasing the object with tool - going back over the place
fr: Réalise un placement à partir d'une position. Un placement est décrit comme : - aller au dessus du placement - descendre jusqu'à la hauteur z - relâcher l'objet avec l'outil - retourner au dessus du placement

source: Executes a pick and place. If an error happens during the movement, error will be raised -> Args param is for development purposes
fr: Réalise un prélèvement puis un placement. Si une erreur se produit, une exception est levée

source: Distance from waypoints before smoothing trajectory
fr: Distance entre les points de passage avant de lisser la trajectoire

source: Trajectories
fr: Trajectoires

source: Gets saved trajectory from robot intern storage Will raise error if position does not exist
fr: Récupération des trajectoires sauvegardées dans le robot. Lève une exception si la position n'existe pas

source: Raises
fr: Lève

source: If trajectory file doesn't exist
fr: si la trajectoire n'existe pas

source: list of [x, y, z, qx, qy, qz, qw]
fr: Liste de [x, y, z, qx, qy, qz, qw]

source: Asks the pose trajectory service which trajectories are available
fr: Renvoie la liste des trajectoires sauvegardées

source: list of trajectory name
fr: Liste des noms des trajectoires

source: Executes trajectory from a list of pose
fr: Réalise un trajectoire à partir d'une liste de position

source: list of [x, y, z, qx, qy, qz, qw] or list of [x, y, z, roll, pitch, yaw]
fr: Liste de [x, y, z, qx, qy, qz, qw] ou liste de [x, y, z, roll, pitch, yaw]

source: Executes trajectory from list of poses and joints
fr: Réalise une trajectoire à partir d'une liste de positions ou d'axes

source: List of [x,y,z,qx,qy,qz,qw] or list of [x,y,z,roll,pitch,yaw] or a list of [j1,j2,j3,j4,j5,j6]
fr: Liste de [x,y,z,qx,qy,qz,qw] ou liste de [x,y,z,roll,pitch,yaw] ou liste de [j1,j2,j3,j4,j5,j6]

source: List of string 'pose' or 'joint', or ['pose'] (if poses only) or ['joint'] (if joints only). If None, it is assumed there are only poses in the list.
fr: Liste de string de valeur 'pose' ou 'joint', ou ['pose'] (si ce n'est que des positions) ou ['joint'] (si que des axes). Sans valeur, la fonction concidère qu'il n'y a que des positions dans la liste.

source: Saves trajectory object and sends it to the trajectory manager service
fr: Sauvegarde de la trajectoire

source: name which will have the trajectory
fr: Nom de la trajectoire

source: list of trajectory_msgs/JointTrajectoryPoint
fr: Liste des trajectory_msgs/JointTrajectoryPoint

source: Sends delete command to the trajectory manager service
fr: Supprime une trajectoire

source: name
fr: nom

source: Dynamic frames
fr: Repères dynamiques

source: Create a dynamic frame with 3 poses (origin, x, y)
fr: Crée un repère dynamique par 3 positions (origine, x, y)

source: name of the frame
fr: nom du repère

source: description of the frame
fr: description du repère

source: 3 poses needed to create the frame
fr: 3 positions nécessaires pour créer le repère

source: indicate if the frame belong to a workspace
fr: indique si le repère appartient à un espace de travail

source: Create a dynamic frame with 3 points (origin, x, y)
fr: Crée un repère dynamique par 3 positions (origine, x, y)

source: 3 points needed to create the frame
fr: 3 positions nécessaires pour créer le repère

source: Modify a dynamic frame
fr: Modifie un repère

source: new name of the frame
fr: nouveau nom du repère

source: new description of the frame
fr: nouvelle description du repère

source: Delete a dynamic frame
fr: Supprime un repère

source: name of the frame to remove
fr: nom du repère dynamique à supprimer

source: Get name, description and pose of a dynamic frame
fr: Obtient le nom, la description et la position d'un repère dynamique

source: name, description, position and orientation of a frame
fr: Obtient le nom, la description et la position d'un repère dynamique

source: Get list of saved dynamic frames
fr: Obtient la liste des repères dynamiques sauvegardés

source: list of dynamic frames name, list of description of dynamic frames
fr: liste des noms des repères dynamiques, liste des descriptions des repères dynamiques

source: Move robot end of a offset in a frame
fr: Déplace l'effecteur d'un offset dans un repère

source: list which contains offset of x, y, z, roll, pitch, yaw
fr: Une liste correspondant à [x, y, z, roll, pitch, yaw]

source: name of local frame
fr: nom du repère

source: Move robot end of a offset by a linear movement in a frame
fr: Déplace l'effecteur avec un mouvement linéaire d'un offset dans un repère

source: Tools
fr: Outils

source: Uses /niryo_robot_tools_commander/current_id topic to get current tool id
fr: Récupération de l'id de l'outil courant via le topic /niryo_robot_tools_commander/current_id

source: Tool Id
fr: Id de l'outil

source: Calls service niryo_robot_tools_commander/update_tool to update tool
fr: Mise a jour de l'outil en appelant le service niryo_robot_tools_commander/update_tool

source: Grasps with the tool linked to tool_id This action corresponds to - Close gripper for Grippers - Pull Air for Vacuum pump - Activate for Electromagnet
fr: Attrape avec l'outil lié à l'id de l'outil. L'action correspond à - Fermer la pince pour une pince - Tirer l'air pour la pompe à vide - Activer l'électroaimant

source: [Only required for electromagnet] Pin ID of the electromagnet
fr: [Seulement pour l'électroaimant] L'ID de la broche de l'électroaimant

source: Releases with the tool associated to tool_id This action corresponds to - Open gripper for Grippers - Push Air for Vacuum pump - Deactivate for Electromagnet
fr: Relâcher avec l'outil lié à l'id de l'outil. L'action correspond à - Ouvri la pince pour une pince - Expulser l'air pour la pompe à vide - Désactiver l'électroaimant

source: Opens gripper with a speed 'speed'
fr: Ouvir la pince avec une vitesse 'speed'

source: Closes gripper with a speed 'speed'
fr: Fermer pince avec une vitesse 'speed'

source: Pulls air
fr: Tirer l'air

source: Setups electromagnet on pin
fr: Installation de l'électroaimant sur la pin

source: Pin ID
fr: Id de la broche

source: Activates electromagnet associated to electromagnet_id on pin_id
fr: Désactiver l'électroaimant associé à electromagnet_id sur pin_id

source: Deactivates electromagnet associated to electromagnet_id on pin_id
fr: Désactiver l'électroaimant associé à electromagnet_id sur pin_id

source: Enables or disables the TCP function (Tool Center Point). If activation is requested, the last recorded TCP value will be applied. The default value depends on the gripper equipped. If deactivation is requested, the TCP will be coincident with the tool_link
fr: Active ou désactive la fonctions PCO (Point Central Objet). Si activé, la dernière valeur du PCO sera appliquée. La valeur par défaut dépend de l'outil équipé. Si désactivé, le PCO coincidera avec le tool_link (point d'attache de l'outil sur le bras)

source: True to enable, False otherwise.
fr: True pour activer, sinon false

source: Activates the TCP function (Tool Center Point) and defines the transformation between the tool_link frame and the TCP frame
fr: Active la fonction PCO (Point Central Objet) et définit la transformation entre le repère tool_link et le repère du PCO

source: Resets the TCP (Tool Center Point) transformation. The TCP will be reset according to the tool equipped
fr: Réinitialise la transformation du PCO (Point Central Objet). Le PCO est réinitialisé selon l'outil équipé

source: Hardware
fr: Matériel

source: Sets pin number pin_id to mode pin_mode
fr: Initialise le numéro de broche pin_id dans le mode pin_mode

source: Sets pin_id state to pin_state
fr: Initialise l'état de la broche pin_id à pin_state

source: The name of the pin
fr: Nom de la broche

source: Reads pin number pin_id and returns its state
fr: Lecture de l'état pin_state de la broche pin_id

source: state
fr: état

source: Gets Digital IO state : Names, modes, states
fr: Récupération de l'état des Entres/Sorties digitales: nom, mode, état

source: Infos contains in a IOsState object (see niryo_robot_msgs)
fr: Informations contenues dans l'objet IOsState (voir niryo_robot_msgs)

source: Gets hardware status : Temperature, Hardware version, motors names & types ...
fr: Récupération de l'état du matériel : Température, version matériel, nom des moteurs et types

source: Infos contains in a HardwareStatus object (see niryo_robot_msgs)
fr: Informations contenues dans l'object HardwareStatus (voir niryo_robot_msgs)

source: Conveyor Belt
fr: Convoyeur

source: Scans for conveyor on can bus. If conveyor detected, returns the conveyor ID
fr: Analyse la présence d'un convoyeur sur le bus can. Si un convoyeur est détecté, renvoie l'id du convoyeur

source: Removes specific conveyor
fr: Retire un convoyeur spécifique

source: Basically, ConveyorID.ONE or ConveyorID.TWO
fr: Essentiellement, ConveyorID.ONE ou ConveyorID.TWO

source: Controls conveyor associated to conveyor_id. Then stops it if bool_control_on is False, else refreshes it speed and direction
fr: Controle du convoyeur associé à conveyor_id. Stop si bool_control_on est False, sinon rafraichit la vitesse et la direction

source: ConveyorID.ID_1 or ConveyorID.ID_2
fr: ConveyorID.ID_1 ou ConveyorID.ID_2

source: True for activate, False for deactivate
fr: True pour activer, False pour désactiver

source: target speed
fr: vitesse ciblée

source: Target direction
fr: Direction ciblées

source: Gets last stream image in a compressed format
fr: Récupération de la dernière image au format compressé

source: string containing a JPEG compressed image
fr: chaine de charactère contenant l'image compressé en JPEG

source: Modifies image brightness
fr: Modifie la luminosité de l'image

source: How much to adjust the brightness. 0.5 will give a darkened image, 1 will give the original image while 2 will enhance the brightness by a factor of 2.
fr: Comment ajuster la luminosité. 0.5 donnera une image assombrie, 1 l'image d'origine et 2 augmentera la luminosité par un facteur 2

source: Modifies image contrast
fr: Modifie le contraste de l'image

source: While a factor of 1 gives original image. Making the factor towards 0 makes the image greyer, while factor>1 increases the contrast of the image.
fr: Plus le facteur est proche de 0, plus l'image deviendra grise

source: Modifies image saturation
fr: Modifie la saturation de l'image

source: How much to adjust the saturation. 0 will give a black and white image, 1 will give the original image while 2 will enhance the saturation by a factor of 2.
fr: Le facteur permet de modifier la valeur de saturation appliquée à l'image.

source: Given a pose (x_rel, y_rel, yaw_rel) relative to a workspace, this function returns the robot pose in which the current tool will be able to pick an object at this pose. The height_offset argument (in m) defines how high the tool will hover over the workspace. If height_offset = 0, the tool will nearly touch the workspace.
fr: Pour une pose (x_rel, y_rel, yaw_rel) relative à l'espace de travail, retourne la position du robot dans laquelle l'outil courant sera capable de prendre un objetL'argument height_offset (en mètre) définir à quelle hauteur l'outil sera placé au dessus de l'espace de travail. Si height_offset=0, l'outil touchera presque l'espace de travail.

source: name of the workspace
fr: nom de l'espace de travail

source: offset between the workspace and the target height
fr: Décalage entre l'espace de travail et l'hauteur ciblé

source: First detects the specified object using the camera and then returns the robot pose in which the object can be picked with the current tool
fr: Commence par détecter l'objet spécifié en utilisant la caméra puis retourne la position du robot dans laquelle l'objet peut être pris avec l'outil courrant

source: shape of the target
fr: Forme de la cible

source: color of the target
fr: Couleur de la cible

source: Move Joints to observation_joints, then executes a vision pick
fr: Déplace les axes à observation_joints, puis réalise une prise par vision

source: Move Pose to observation_pose, then executes a vision pick
fr: Déplace la position à observation_pose, puis réalise une prise par vision

source: Picks the specified object from the workspace. This function has multiple phases: 1. detects object using the camera 2. prepares the current tool for picking 3. approaches the object 4. moves down to the correct picking pose 5. actuates the current tool 6. lifts the object
fr: Prise d'un objet spécifique dans un espace de travail. Les phases 1. détection de l'objet via la caméra 2. préparation de l'outil courant pour la prise 3. rappochement vers l'objet4. déscente jusqu'à la position de pirse. 5. Actionne l'outil courrant. 6. soulève l'outil

source: Same as `get_target_pose_from_cam` but directly moves to this position
fr: idem que `get_target_pose_from_cam` mais déplacement direct vers la position

source: Gets calibration object: camera intrinsics, distortions coefficients
fr: Récupération de l'objet calibration : paramètres intrinsèques, coéfficients de distortions

source: raw camera intrinsics, distortions coefficients
fr: paramètres intrinsèques, coéfficients de distortions

source: Saves workspace by giving the poses of the robot to point its 4 corners with the calibration Tip. Corners should be in the good order
fr: Sauvegarde de l'espace de travail en donnat les positions du robot permettant de cibler les 4 coins avec l'outil de calibration. Les coins doivent être donnés dans le bon ordre

source: workspace name, max 30 char.
fr: nom de l'espace de travail. Max 30 charactères

source: list of 4 corners pose
fr: Liste des 4 positions des coins

source: Saves workspace by giving the poses of its 4 corners in the good order
fr: Sauvegarde de l'espace de travail en donnant la listes des 4 positions des coins dans le bon ordre

source: list of 4 corners [x, y, z]
fr: Liste des 4 coins [x, y, z]

source: Calls workspace manager to delete a certain workspace
fr: Supprime un espace de travail

source: workspace name
fr: Nom de l'espace de travail

source: Gets the 4 workspace poses of the workspace called 'name'
fr: Récupération des 4 positions des coins de l'espace de travail donné par 'name'

source: List of the 4 workspace poses
fr: Liste des 4 positions des coins de l'espace de travail

source: Gives the length over width ratio of a certain workspace
fr: Récupération du ratiot longueur sur largeur de l'espace de travail

source: Asks the workspace manager service names of the available workspace
fr: Récupération de la liste des espaces de travail

source: list of workspaces name
fr: Liste des noms des espaces de travail

source: Sound
fr: Son

source: For more function, please refer to: :ref:`Sound API functions<source/stack/high_level/niryo_robot_sound:Sound API functions>`
fr: Pour plus d'informations, se référer à: :ref:`Son API <source/stack/high_level/niryo_robot_sound:Sound API functions>`

source: Manages sound
fr: Gérer le son

source: Example: ::
fr: Exemple: ::

source: Led Ring
fr: Anneau LED

source: For more function, please refer to: :ref:`Led Ring API functions<source/stack/high_level/niryo_robot_led_ring:Led Ring API functions>`
fr: Pour plus d'informations, se référer à: :ref:`Led Ring API <source/stack/high_level/niryo_robot_led_ring:Led Ring API functions>`

source: Manages the LED ring
fr: Contrôler l'anneau LED

source: Custom Button
fr: Bouton 'Custom'

source: Manages the custom button
fr: Contrôler le bouton *custom*

source: Get the button state from the ButtonAction class
fr: Obtenir l'état du bouton à partir de la classe ButtonAction

source: int value from the ButtonAction class
fr: valeur entière provenant de la classe ButtonAction

source: Button press state
fr: Etat d'appuie du bouton

source: Waits until a specific action occurs and returns true. Returns false if the timeout is reached.
fr: Attendre jusqu'à ce que l'action attendue intervienne et retourne True. Retournefalse si le délais d'attente est atteint.

source: True if the action has occurred, false otherwise
fr: True si une action est intervenue, false sinon

source: Returns the detected action. Returns ButtonAction.NO_ACTION if the timeout is reached without action.
fr: Retourne l'action détectée. Retourne ButtonAction.NO_ACTION si le délais d'attente est atteint sans action.

source: Returns the detected action, or ButtonAction.NO_ACTION if the timeout is reached without any action.
fr: Renvoie l'action détectée, ou ButtonAction.NO_ACTION si le délai est atteint sans aucune action.

source: Waits for the button to be pressed and returns the press time. Returns 0 if no press is detected after the timeout duration.
fr: Attend que le bouton soit pressé et renvoie le temps d'appuie.Renvoie 0 si aucune pression n'est détectée après la durée du délai d'attente.

source: Enums
fr: Enumération

source: Tools IDs (need to match tools ids in niryo_robot_tools_commander package)
fr: Id de l'outil (doit correspondre à l'id de l'outil du package niryo_robot_tools_commander)

source: Pin Mode is either OUTPUT or INPUT
fr: Le Mode d'une broche peut être SORTIE ou ENTREE

source: Pin State is either LOW or HIGH
fr: L'état d'une broche peut être BAS ou HAUT

source: Pins ID
fr: ID de la broche
