Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/python_ros_wrapper/ros_wrapper_doc.po
Languages: fr

source: ConveyorID to be able to have CAN (id 12 and 13) and TTL (id 9 and 10) conveyor in any possible combination
fr: ConveyorID pour contrôler des convoyeurs CAN (id 12 and 13) and TTL (id 9 and 10)

source: ConveyorID to control conveyors with CAN interface
fr: ConveyorID afin de contrôler les convoyeurs avec une interface CAN

source: ConveyorID to control conveyors with TTL interface
fr: ConveyorID afin de contrôler les convoyeurs avec une interface CAN
