Repository: twming/robotic_arm_niryo
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/quick_start.po
Languages: fr

source: Quick start
fr: Démarrage rapide

source: Welcome to the robot quick start. Here you will learn the essential features of the robot to get you started.
fr: Bienvenue dans le démarrage rapide du robot. Ici, vous apprendrez les fonctionnalités essentielles du robot pour vous aider à démarrer.

source: Robot connection
fr: Connexion au robot

source: There are 4 ways to connect your computer to the robot:
fr: Il existe 4 façons de connecter votre ordinateur au robot :

source: **Difficulty:** :green:`Easy`
fr: **Difficulté :** :green:`Facile`

source: **Description:** The robot provides its own Wi-Fi network. In this mode, you can connect to the robot like any other Wi-Fi network. |br| The network name is in the format of **NiryoRobot xx-xx-xx** and the default password is **niryorobot**. To change the name of the robot, refer to the section: `Robot Name <https://docs.niryo.com/product/niryo-studio/source/settings.html#robot-name>`_ .
fr: **Description :** Le robot émet son propre réseau Wi-Fi. Dans ce mode, vous pouvez vous connecter au robot comme n'importe quel autre réseau Wi-Fi. |br| Le nom du réseau est au format **NiryoRobot xx-xx-xx** et le mot de passe par défaut est **niryorobot**. Pour changer le nom du robot, reportez-vous à la section : `Nom du robot <https://docs.niryo.com/product/niryo-studio/source/settings.html#robot-name>`_.

source: **More informations:** `Wi-Fi settings <https://docs.niryo.com/product/niryo-studio/source/settings.html#ned-wi-fi-setting>`_, `Using Ned in Hotspot mode <https://docs.niryo.com/product/niryo-studio/source/connection.html#using-ned-in-hotspot-mode>`_ .
fr: **Plus d'informations :** `Paramètres Wi-Fi <https://docs.niryo.com/product/niryo-studio/source/settings.html#ned-wi-fi-setting>`_, `Utiliser le robot en Hotspot <https://docs.niryo.com/product/niryo-studio/source/connection.html#using-ned-in-hotspot-mode>`_.

source: **Advantage:** Easy, no cable required.
fr: **Avantage :** Facile, aucun câble requis.

source: **Disadvantage:** Ethernet connection needed on the computer to have access to the internet. The robot has no access to the internet and cannot update itself.
fr: **Inconvénient :** Connexion Ethernet nécessaire sur l'ordinateur pour avoir accès à Internet. Le robot n'a pas accès à Internet et ne peut pas se mettre à jour.

source: **IP address:** 10.10.10.10
fr: **Adresse IP :** 10.10.10.10

source: Connected mode
fr: Mode connecté

source: **Difficulty:** :orange:`Medium`
fr: **Difficulté :** :orange:`Moyenne`

source: **Description:** The robot is connected to an existing Wi-Fi network.
fr: **Description :** Le robot est connecté à un réseau Wi-Fi existant.

source: **More informations:** `Wi-Fi settings <https://docs.niryo.com/product/niryo-studio/source/settings.html#ned-wi-fi-setting>`_, `Using Ned on your Wi-Fi network <https://docs.niryo.com/product/niryo-studio/source/connection.html#using-ned-on-your-wi-fi-network>`_ .
fr: **Plus d'informations :** `Paramètres Wi-Fi <https://docs.niryo.com/product/niryo-studio/source/settings.html#ned-wi-fi-setting>`_, `Utiliser Ned sur votre réseau Wi-Fi <https://docs.niryo.com/product/niryo-studio/source/connection.html#using-ned-on-your-wi-fi-network>`_.

source: **Advantage:** Ethernet connection needed on the computer to have access to the internet. The robot has no access to the internet and cannot update itself.
fr: **Avantage :** Connexion Ethernet nécessaire sur l'ordinateurpour avoir accès à Internet. Le robot n'a pas accès à Internet et ne peut pas se mettre à jour.

source: **Disadvantage:** Stable Wi-Fi connection required.
fr: **Inconvénient :** Connexion Wi-Fi stable requise.

source: **IP address:** Dependant of your network.
fr: **Adresse IP :** En fonction de votre réseau

source: **Description:** The robot is connected directly to the computer via an ethernet cable.
fr: **Description :** Le robot est connecté directement à l'ordinateur via un câble Ethernet.

source: **More informations:** `Ethernet settings <https://docs.niryo.com/product/niryo-studio/source/settings.html#network-settings>`_, `Using Ned with an Ethernet cable <https://docs.niryo.com/product/niryo-studio/source/connection.html#using-ned-with-an-ethernet-cable>`_ .
fr: **Plus d'informations :** `Paramètres Ethernet <https://docs.niryo.com/product/niryo-studio/source/settings.html#network-settings>`_, `Utiliser Ned avec un câble Ethernet <https : //docs.niryo.com/product/niryo-studio/source/connection.html#using-ned-with-an-ethernet-cable>`_.

source: **Advantage:** The computer can have access to the internet through Wi-Fi. Safer and better communication with the robot.
fr: **Avantage :** L'ordinateur peut avoir accès à Internet via le wifi. Une communication plus sûre et plus robuste avec le robot.

source: **Disadvantage:** Cable required. The robot has no access to the internet and cannot update itself.
fr: **Inconvénient :** Câble requis. Le robot n'a pas accès à Internet et ne peut pas se mettre à jour.

source: **IP address:** 169.254.200.200
fr: **Adresse IP :** 169.254.200.200

source: Ethernet through network
fr: Ethernet via le réseau

source: **Description:** The robot is connected to the network via an ethernet cable, and the computer is connected to the network via an ethernet cable or via Wi-Fi.
fr: **Description :** Le robot est connecté au réseau via un câble Ethernet et l'ordinateur est connecté au réseau via un câble Ethernet ou via Wi-Fi.

source: **More informations:** `Ethernet settings <https://docs.niryo.com/product/niryo-studio/source/settings.html#network-settings>`_ .
fr: **Plus d'informations :** `Paramètres Ethernet <https://docs.niryo.com/product/niryo-studio/source/settings.html#network-settings>`_.

source: **Advantage:** The robot and the computer can have access to the internet. Better communication with the robot.
fr: **Avantage :** Le robot et l'ordinateur peuvent avoir accès à Internet. Meilleure communication avec le robot.

source: **Disadvantage:** Cable required.
fr: **Inconvénient :** Câble requis.

source: Robot programming
fr: Programmation de robots

source: There are 6 ways to program Niryo's robots:
fr: Il existe 6 façons de programmer les robots Niryo :

source: Ways to program the Niryo robots
fr: Façons de programmer les robots Niryo

source: Name
fr: Nom

source: Language
fr: Langue

source: Difficulty
fr: Difficulté

source: :green:`Beginner`
fr: :green:`Débutant`

source: Simplified block programming.
fr: Programmation simplifiée par blocs.

source: Program your use cases as quickly as possible.
fr: Programmez vos cas d'usages le plus rapidement possible.

source: :orange:`Intermediate`
fr: :orange:`Intermédiaire`

source: Program your robot remotely via a Python API 2.7 and 3.X .
fr: Programmez votre robot à distance via une API Python 2.7 et 3.X.

source: Program and run your Python code directly in the robot.
fr: Programmez et exécutez votre code Python directement dans lerobot.

source: No software or setup required except Niryo Studio or an ssh terminal.
fr: Aucun logiciel ou configuration requis, à l'exception de Niryo Studio ou d'un terminal ssh.

source: :red:`Advanced`
fr: :red:`Avancé`

source: Program and run your ROS node directly on the robot,
fr: Programmez et exécutez votre nœud ROS directement sur le robot,

source: or remotely through ROS Multimachine.
fr: ou à distance via ROS Multimachine.

source: Any
fr: Tous

source: Programs can communicate through network MODBUS
fr: Les programmes peuvent communiquer via le réseau MODBUS

source: with the robots in any language available.
fr: avec les robots dans toutes les langues disponibles.

source: TCP Server
fr: Serveur TCP

source: `TCP Server <https://docs.niryo.com/dev/ros/source/tcp_server.html>`_
fr: `Serveur TCP <https://docs.niryo.com/dev/ros/source/tcp_server.html>`_

source: Programs can communicate through network TCP
fr: Les programmes peuvent communiquer via le réseau TCP

source: Niryo One and Ned tips
fr: Astuces Niryo One et Ned

source: Program your first move in 30 seconds
fr: Programmez votre premier mouvement en 30 secondes

source: The fastest way to program the robot is via `Blockly <https://docs.niryo.com/product/niryo-studio/source/blockly_api.html>`_. When you are on the Blockly page and logged into the robot, switch to learning mode via the toggle. You can then press the button on top of the robot's base once to bring up a block with the robot's current position. Thus, move your robot by hand, press the button and connect the blocks. Congratulations you have programmed a robot at lightning speed!
fr: Le moyen le plus rapide de programmer le robot est via `Blockly <https://docs.niryo.com/product/niryo-studio/source/blockly_api.html>`_. Lorsque vous êtes sur la page Blockly et connecté au robot, passez en mode d'apprentissage via le bouton toggle. Vous pouvez ensuite appuyer une fois sur le bouton au-dessus de la base du robot pour faire apparaître un bloc avec la position actuelle du robot. Ainsi, déplacez votre robot à la main, appuyez sur le bouton, reliez les blocs. Félicitations, vous avez programmé un robot à la vitesse de l'éclair !

source: At the top right of the Blockly window, you can choose to save the positions in either **Joints** or **Pose** mode.
fr: En haut à droite de la fenêtre Blockly, vous pouvez choisir d'enregistrer les positions en mode **Joints** ou **Pose**.

source: Joints & Poses, what's the difference?
fr: Articulations & Poses, quelle est la différence ?

source: The joints are the different joints of the robot. In joint mode, you give the robot a command on each of the robot motors. The default unit used is the radian. 6.28318530718 radian is 2π and corresponds to 360°. On Niryo Studio you can switch to degrees for more simplicity.
fr: Les **joints** sont les différentes articulations du robot. En mode **joints**, vous donnez au robot une commande sur chacun des moteurs du robot. L'unité par défaut utilisée est le radian. 6,28318530718 radian vaut 2π et correspond à 360°. Sur Niryo Studio vous pouvez passer aux degrés pour plus de simplicité.

source: The Pose corresponds to the x, y, z coordinates and the roll, pitch, yaw orientation (respecting the rotation around the x, y, z axes) of the extremity of the robot. The x-axis is directed to the front of the robot, and the y-axis to the left of the robot. A positive x-coordinate will move the robot forward. A positive y-coordinate will move the robot to the left, and negative y will move the robot to the right.
fr: La **Pose** correspond aux coordonnées x, y, z et à l'orientation roulis, tangage, lacet (respectivement, la rotation autour des axes x, y, z) de l'extrémité du robot. L'axe x est dirigé vers l'avant du robot et l'axe y vers la gauche du robot. Une coordonnée x positive fera avancer le robot. Une coordonnée y positive déplacera le robot vers la gauche et une coordonnée y négative déplacera le robot vers la droite.

source: Sometimes there can be several axis configurations of the robot that correspond to the same coordinates. This is why it is recommended to use the **Joints** commands instead. The **Pose** is however easier and more intuitive to use to ask the robot to go for example 10cm higher, or 10 to the right.
fr: Parfois, il peut y avoir plusieurs configurations d'axes du robot qui correspondent aux mêmes coordonnées. C'est pourquoi il est recommandé d'utiliser les commandes **Joints**. La **Pose** est cependant plus facile et plus intuitive à utiliser pour demander au robot d'aller par exemple 10cm plus haut, ou 10 vers la droite.

source: Use a tool
fr: Utiliser un outil

source: To use a tool, remember to use the **scan** function to detect the connected tool. You can then use the grippers, the Vacuum Pump or the Electromagnet as you wish.
fr: Pour utiliser un outil, pensez à utiliser la fonction **scan** pour détecter l'outil connecté. Vous pouvez ensuite utiliser les grippers, la Pompe à vide ou l'Electroaimant à votre guise.

source: Remember to add the scan function at the beginning of each of your programs to avoid any surprises.
fr: Pensez à ajouter la fonction **scan** au début de chacun de vos programmes pour éviter toute surprise.

source: Our different tools are intelligent, so the robot will be able to adapt its movements according to the selected tool for a pick and place with vision. Also, you can program your movements with **Pose**. By activating the `TCP (Tool Center Point) <https://docs.niryo.com/product/niryo-studio/source/settings.html#robot-tcp-tool-center-point>`_ function, the TCP of the robot, and therefore the movements, will adapt to the tool equipped.
fr: Nos différents outils sont intelligents, ainsi le robot pourra adapter ses mouvements en fonction de l'outil sélectionné pour un *pick and place* avec vision. De plus, vous pouvez programmer vos mouvements avec **Pose**. En activant la fonction `TCP (de l'anglais Tool Center Point, Point Central de l'Outil en Français) <https://docs.niryo.com/product/niryo-studio/source/settings.html#robot-tcp-tool-center-point>`_, le TCP du robot, et donc les mouvements, s'adapteront à l'outil équipé.

source: Standard, linear, waypointed moves, what's the difference?
fr: Déplacements standards, linéaires, points de passage, quelle est la différence ?

source: There are many different types of movement possible for robot arms. The 3 most used are the following:
fr: Il existe de nombreux types de mouvements différents possibles pour les bras de robot. Les 3 plus utilisés sont les suivants :

source: **Standard movements:** Also called PTP (Point To Point). This is the simplest movement. In this type of movement, the duration of the movement is minimized, each joint reaches the final position at the same time. The robot draws a kind of arc of a circle according to the initial and final positions.
fr: **Mouvements standards :** Aussi appelé PTP (Point To Point). C'est le mouvement le plus simple. Dans ce type de mouvement, la durée du mouvement est minimisée, chaque articulation atteint la position finale en même temps. Le robot dessine une sorte d'arc de cercle selon les positions initiale et finale.

source: **Linear movements:** The robot draws a straight line between the start and end position However, a linear movement is not always possible between two points depending on the constraints of the robot. Make sure that the movement is feasible. If not, the robot will return an error.
fr: **Mouvements linéaires :** Le robot trace une ligne droite entre la position de départ et la position finale. Cependant, un mouvement linéaire n'est pas toujours possible entre deux points en fonction des contraintes du robot. Veillez donc bien faire attention à ce que le mouvement soit réalisable. Dans le cas contraire le robot retournera une erreur.

source: **Smoothed movements by waypoints:** This is where we ask the robot to make a movement to an end point by passing through intermediate points. The robot draws linear paths, or PTP if linear motion is not possible, between each waypoint without stopping. It is also possible to record blend radius to smooth the movement and to draw curves between the points. This path is ideal for dodging obstacles.
fr: **Mouvements lissés par points de passage :** C'est ici que nous demandons au robot d'effectuer un mouvement jusqu'à un point final en passant par des points intermédiaires. Le robot dessine des trajectoires linéaires, ou PTP si le mouvement linéaire n'est pas possible, entre chaque point de passage sans s'arrêter. Il est également possible d'enregistrer le rayon de courbure pour lisser le mouvement et dessiner des courbes entre les points. Ce mouvement est idéal pour éviter les obstacles.

source: `Waypointed trajectory with blend radius <https://ros-planning.github.io/moveit_tutorials/doc/pilz_industrial_motion_planner/pilz_industrial_motion_planner.html#user-interface-sequence-capability>`_
fr: `Trajectoire par points de passage avec rayon de fusion <https://ros-planning.github.io/moveit_tutorials/doc/pilz_industrial_motion_planner/pilz_industrial_motion_planner.html#user-interface-sequence-capability>`_

source: Start, Pause, Cancel a program execution
fr: Démarrer, Pause, Annuler l'exécution d'un programme

source: You may not know it, but the button on the top of the base of the robot also allows you to start, pause and stop a program.
fr: Vous ne le saviez peut-être pas, mais le bouton situé en haut de la base du robot permet également de démarrer, de mettre en pause et d'arrêter un programme.

source: When a program is running:
fr: Lorsqu'un programme est en cours d'exécution :

source: 1 press pauses the program
fr: 1 appui met le programme en pause

source: 2 presses will pause the programme and activate the learning mode
fr: 2 appuis mettront le programme en pause et activeront le mode apprentissage

source: When a program is paused:
fr: Lorsqu'un programme est en pause :

source: 1 press resumes the program
fr: 1 appui reprend le programme

source: 2 presses stop the program
fr: 2 appuis arrête le programme

source: If there is no intervention for 30 seconds, the programme stops automatically
fr: S'il n'y a pas d'intervention pendant 30 secondes, le programme s'arrête automatiquement

source: When the program is paused, the LED at the back flashes white.
fr: Lorsque le programme est en pause, la LED à l'arrière clignote en blanc.

source: When no program is running you can also start a program by pressing the same button once. To set it up, go to the `Program Autorun <https://docs.niryo.com/product/niryo-studio/en/source/programs.html#program-autorun>`_.
fr: Lorsqu'aucun programme n'est en cours, vous pouvez également démarrer un programme en appuyant une fois sur le même bouton. Pour le configurer, référez vous à la section `Programme Autorun <https://docs.niryo.com/product/niryo-studio/source/programs.html#program-autorun>`_.
