Repository: twming/robotic_arm_niryo
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/source/ros_wrapper.po
Languages: fr

source: Control with Python ROS Wrapper
fr: Contrôle avec Python ROS Wrapper

source: Python Logo
fr: Logo Python

source: In order to control Ned more easily than calling each topics & services one by one, a Python ROS Wrapper has been built on top of ROS.
fr: Pour contrôler le Ned plus simplement qu'en appelant chaque topic et service l'un après l'autre, une API python d'encapsulation de ROS, appelée dans la suite Python ROS Wrapper, a été construite au dessus de ROS.

source: For instance, a script realizing a moveJ via Python ROS Wrapper will look like: ::
fr: Par exemple, un script réalisant un moveJ via Python ROS Wrapper ressemblera a : ::

source: What this code is doing in a hidden way:
fr: Ce que fait ce code en arrière plan :

source: It generates a :ref:`RobotMove Action Goal<source/stack/high_level/niryo_robot_arm_commander:RobotMove>` and set it as a joint command with the corresponding joints value.
fr: Il génère un :ref:`RobotMove Action Goal<source/stack/high_level/niryo_robot_arm_commander:RobotMove>` et le définit comme une command de joint avec les valeurs de joints correspondantes.

source: Sends goal to the Commander Action Server.
fr: Envoie un but au Commander Action Server.

source: Waits for the Commander Action Server to set Action as finished.
fr: Attend que le Commander Action Server définisse l'Action comme "finished".

source: Checks if action finished with a success.
fr: Vérifie si l'action s'est terminée avec succès.

source: In this section, we will give some examples on how to use the Python ROS Wrapper to control Ned, as well as a complete documentation of the functions available in the Ned Python ROS Wrapper.
fr: Dans cette section, vous trouverez quelques exemples d'utilisation de Python ROS Wrapper pour contrôler le Ned, ainsi qu'une documentation complète des fonctions présentes dans Ned Python ROS Wrapper.

source: The Python ROS Wrapper forces the user to write his code directly in the robot, or, at least, copy the code on the robot via a terminal command. If you do not want that, and run code directly from your computer you can use the python Package :ref:`source/more:PyNiryo`.
fr: Le Python ROS Wrapper force l'utilisateur à écrire son code directement dans le robot, ou à minima, copier le code sur le robot via une commande en terminal. Si vous ne souhaitez pas faire cela et lancer directement le code depuis votre ordinateur, vous pouvez utiliser le package Python :ref:`source/more:PyNiryo`.

source: Section Contents:
fr: Section Contenus :
