Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/stack/low_level/can_debug_tools.po
Languages: fr

source: This package offers scripts to debug with Hardware and setup CAN devices. It provides some main functions like setting up the CAN bus and dumping data on bus.
fr: Ce package contient des scripts utilisables pour debugguer et configurer des périphériques CAN. Il expose plusieurs fonctions principales comme l'initialisation du bus CAN et le sniffing de données sur le bus.

source: Niryo robot - CAN debug tools
fr: Niryo robot - Outils de debuguage

source: It provides service to dump data on CAN bus. This script can be launched via: ::
fr: Il fournit des services pour afficher les données circulant sur le bus CAN en temps réel. Ce script peut être lancé via : ::

source: Parameters - CAN debug tools
fr: Paramètres - Outil de debuguage CAN

source: **--help / -h:** Prints help message
fr: **--help / -h:** Affiche l'aide

source: **--baudrate / -b [Baudrate]:** Baudrates (1000000 by default)
fr: **--baudrate / -b [Baudrate]:** Débit Baud (1000000 par défaut)

source: **--channel / -c [Channel]:** Sets channel SPI (0 by default)
fr: **--channel / -c [Channel]:** Canal SPI à utiliser (0 par défaut)

source: **--gpio / -g:** GPIO Interrupts for CAN (25 by default)
fr: **--gpio / -g:** Pin d'interruption GPIO pour le CAN (25 par défaut)

source: **--freq / -f:** frequency of control loop to check data (100Hz by default)
fr: **--freq / -f:** Fréquence de la boucle de control pour vérifier les données (100Hz par défaut)

source: **--dump:** runs dump service to dump and shows all data found on bus
fr: **--dump:** Lance le service de "dump" pour afficher en temps réel toutes les données circulant sur le bus

source: When you dump data on CAN bus, the result is a table including:
fr: Quand vous affichez les données circulant sur le bus, le résultat du tableau inclut :

source: Number of data's package
fr: Nombre de données du package

source: Status of package
fr: Status du package

source: Control byte
fr: Octet de contrôle

source: Data in 8 bytes
fr: Données sur 8 octets
