Repository: twming/robotic_arm_niryo
Catalog: src_original/sphinx_doc/locale/*/LC_MESSAGES/source/stack/low_level/ttl_debug_tools.po
Languages: fr

source: This package is a debugging package to setup and access directly to all hardware components on the TTL bus. It provides main functions like ping, scan device and read/write/syncRead/syncWrite operations on devices.
fr: Ce package est un package de débogage pour configurer et accéder directement aux composants matériels présents sur le bus TTL. Il expose des fonctions principales comme le ping, le scan de périphérique et les opérations de lecture/écriture/lecture synchrone/écriture synchrone sur les périphériques.

source: There are two ways to use this package: directly with the compiled binary, or via :doc:`ttl_driver` services called in dedicated scripts.
fr: Il y a deux manières d'utiliser ce package : directement avec le binaire compilé, ou via :doc:`ttl_driver` en utilisant les scripts dédiés.

source: Ttl debug tool binary
fr: Binaire Ttl debug tool

source: The compiled binary (located in *install/lib/ttl_debug_tools/ttl_debug_tools*) directly accesses the TTL bus using :doc:`../third_parties/dynamixel_sdk` third party library. Thus, it cannot be used if the Niryo ROS Stack is already running and you should first stop the robot stack (sudo service niryo_robot_ros stop)
fr: Le binaire compilé (situé dans *install/lib/ttl_debug_tools/ttl_debug_tools*) accède directement au bus TTL en utilisant la librairie tierce :doc:`../third_parties/dynamixel_sdk`. Il ne peut donc pas être utilisé si la stack ROS Niryo est déja en train de tourner et vous devez d'abord arrêter la stack du robot (sudo service niryo_robot_ros stop)

source: This tool can be launched via: ::
fr: Cet outils peut être lancé via : ::

source: or ::
fr: ou ::

source: Parameters - Ttl debug tools
fr: Paramètres - Ttl debug tools

source: **--help / -h:** Prints help message
fr: **--help / -h:** Affiche l'aide

source: **--baudrate / -b [Baudrate]:** Baudrates (1000000 by default)
fr: **--baudrate / -b [Baudrate]:** Débit de Baud (1000000 par défaut)

source: **--port / -p [Port]:** Sets port
fr: **--port / -p [Port]:** Indique le port à utiliser

source: **--id / -i [ID]:** Devices ID (-1 by default)
fr: **--id / -i [ID]:** ID du périphérique (-1 par défaut)

source: **--ids [IDs]:** Lists of devices IDs
fr: **--ids [IDs]:** Liste des ids des périphériques

source: **--scan:** Scans all devices on the bus
fr: **--scan:** Scanne tous les périphériques sur le bus

source: **--ping:** Pings specific ID
fr: **--ping:** Ping un id spécifique

source: **--get-register [Addr]:** Gets a value from a register, parameters is: register address
fr: **--get-register [Addr]:** Lire une valeur depuis un registre; le paramètre est : addresse du registre

source: **--get-registers [Addr]:** Gets list of values from multiple devices at a register address, parameters is: register address
fr: **--get-registers [Addr]:** Récupérer la liste des valeurs sur plusieurs périphériques à une adresse de registre, le paramètre est : addresse du registre

source: **--get-size [Size]:** Size of data to be read with get-register or get-registers, parameters is: size of data in bytes
fr: **--get-size [Size]:** Taille des données à lire avec get-register ou get-registers, le paramètre est : taille des données en octets

source: **--set-register [Addr] [Value] [Size]:** Sets a value to a register, parameters are in the order: register address / value / size (in bytes) of the data
fr: **--set-register [Addr] [Value] [Size]:** Ecrit une valeur en registre, les paramètres sont dans l'ordre : adresse du registre / valeur / taille (en octets) des données

source: **--set-registers [Addr] [Values] [Size]:** Sets values to a register on multiple devices, parameters are in the order: register address / list of values / size (in bytes) of the data
fr: **--set-registers [Addr] [Values] [Size]:** Ecrit des valeurs en registre sur plusieurs périphériques, les paramètres sont dans l'ordre : adresse du registre / liste des valeurs / taille (en octets) des données

source: **--calibrate:** Calibrates all steppers on the bus. It is used in Ned2 only
fr: **--calibrate:** Calibre tous les steppers sur le bus. Utilisable sur le NED2 seulement

source: In order to use Ttl debug tools to debug an already running ROS stack, it was necessary to develop another tool. To do so, two python scripts have been developped. They ensure access to the data on the TTL bus via two services implemented in the package :doc:`ttl_driver`:
fr: Afin de pouvoir utiliser Ttl debug tools pour déboger une stack ROS en train de tourner, il était nécessaire de développer un autre outil. Pour cela, deux scripts python on été développés. Ils permettent d'accéder aux données du bus TTL via deux services implémentés dans le package :doc:`ttl_driver` :

source: read_custom_dxl_value.py : uses service :ref:`ReadCustomValue<source/stack/low_level/ttl_driver:ReadCustomValue (Service)>` to read values from the TTL bus
fr: read_custom_dxl_value.py : utilise le service :ref:`ReadCustomValue<source/stack/low_level/ttl_driver:ReadCustomValue (Service)>` pour lire les valeurs depuis le bus TTL

source: send_custom_dxl_value : uses service :ref:`SendCustomValue<source/stack/low_level/ttl_driver:SendCustomValue (Service)>` to write values to the TTL bus
fr: send_custom_dxl_value : utilise le service :ref:`SendCustomValue<source/stack/low_level/ttl_driver:SendCustomValue (Service)>` pour écrire les valeurs sur le bus TTL

source: Niryo robot - Send DXL custom value
fr: Niryo robot - Envoie une valeur personnalisée sur le Dynamixel

source: It uses a ttl_driver service to send data to a register of a device on the TTL bus when the ROS stack is running. This script can be launched via: ::
fr: Il utilise un service de ttl_driver pour envoyer des données sur le registre des périphériques TTL quand la stack ROS tourne. Ce script peut être lancé via : ::

source: Parameters - Send custom value
fr: paramètres - Send custom value

source: **--id [ID]:** Device ID
fr: **--id [ID]:** ID du périphérique

source: **--address [Addr]:** Registers address to modify
fr: **--address [Addr]:** Adresses registres à modifier

source: **--value [Value]:** Value to store at the register address given
fr: **--value [Value]:** Valeur à écrire sur l'adresse registre donnée

source: **--size [Size]:** Size in bytes of the data to write
fr: **--size [Size]:** Taille en octets pour la donnée à écrire

source: It uses a service to read data from a register a device on the TTL bus when the ROS stack is running. This script can be launched via: ::
fr: Il utilise un service pour lire des données sur le registre des périphériques TTL quand la stack ROS tourne. Ce script peut être lancé via : ::

source: Parameters - Read custom value
fr: paramètres - Read custom value

source: **--address [Addr]:** Register address to modify
fr: **--address [Addr]:** Adresses registres à modifier

source: **--size [Size]:** Size in bytes of the data to read
fr: **--size [Size]:** taille en octet des données à lire
