Repository: twming/robotic_arm_niryo
Catalog: src/sphinx_doc/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Ned ROS documentation
fr: Ned - Documentation ROS

source: This documentation contains everything you need to understand Ned's functioning and how to control it through ROS.
fr: Cette documentation contient tout ce dont vous avez besoin pour comprendre le fonctionnement de Ned et comment le contrôler via ROS.

source: It is made as well for users who are using the "physical" robot as for those who want to use a virtual version.
fr: Il s'adresse aussi bien aux utilisateurs qui utilisent le robot en "physique" qu'à ceux qui souhaitent utiliser une version simulée.

source: Preamble
fr: Introduction

source: Before diving into the software's documentation, you can learn more about the robot development in the :doc:`Overview <source/stack/overview>` section.
fr: Avant de se plonger dans la documentation ROS, vous pouvez en savoir plus sur le développement du robot dans la section :doc:`vue d'ensemble <source/stack/overview>`.

source: Then, you should check the :doc:`source/installation/getting_started` section to setup your environment and try out the stack by yourself. If you don't have a real robot at your disposal, you can still simulate it via the :doc:`source/simulation` section.
fr: Vous pouvez ensuite allez lire la section :doc:`source/installation/getting_started` pour mettre en place votre environnement et essayer la stack par vous-même. Si vous n'avez pas de robot réel à disposition, vous pouvez toujours le simuler via la section :doc:`source/simulation`.

source: Ned Control via ROS
fr: Contrôler Ned via ROS

source: Ned is fully based on ROS.
fr: Ned est entièrement basé sur ROS.

source: ROS Direct control
fr: Contrôle direct du Ned avec ROS

source: To control the robot directly with ROS, you will need either to be connected in SSH to the physical robot, or to use the simulation.
fr: Pour contrôler le robot directement avec ROS, il est nécessaire d’être connecté en SSH au robot physique, ou d’utiliser la simulation.

source: ROS is the most direct way to control the robot. It allows you to:
fr: ROS est le moyen le plus direct de contrôler le robot. Il permet :

source: Send commands via the terminal in order to call services, trigger actions, ...
fr: D’envoyer une commande via le terminal pour appeler des services, déclencher une action, ...

source: Write an entire Python/C++ node to realize a full process.
fr: D’écrire un nœud Python/C++ entier dans un script afin de réaliser un processus complet.

source: See :doc:`ROS <source/stack/high_level>` section to see all Topic & Services available.
fr: Se diriger vers la section :doc:`ROS <source/stack/high_level>` pour voir tous les Topics et Services disponibles.

source: To use Python ROS Wrapper, you will need either to be connected in SSH to the physical robot, or to use the simulation.
fr: Pour utiliser Python ROS Wrapper, il faut être connecté en SSH au robot physique, ou alors utiliser la simulation.

source: The Python ROS Wrapper is built on top of ROS to allow a faster development than ROS. Programs are run directly on the robot which allows to trigger them with the robot's button once a computer is no longer needed.
fr: Le Python ROS Wrapper une surcouche à ROS pour permettre un développement plus rapide que ROS. Les programmes sont exécutés directement sur le robot, ce qui permet de les déclencher avec le bouton du robot une fois qu’un ordinateur n’est plus nécessaire.

source: See :doc:`Python ROS Wrapper <source/ros_wrapper>` to see which functions are accessible and examples on how to use them.
fr: Rendez vous sur la documentation :doc:`Python ROS Wrapper <source/ros_wrapper>` pour voir les fonctions accessibles et des exemples d’utilisation.

source: More ways
fr: Autres alternatives

source: Other methods are available to control the robot allowing the user to code and run programs outside its terminal.
fr: D'autres méthodes sont disponibles pour contrôler Ned afin de permettre à l'utilisateur de coder et d'exécuter des programmes en dehors de son terminal.

source: Learn more on this :doc:`section <source/more>`.
fr: En savoir plus sur cette :doc:`section <source/more>`.
